oracle.connector.display=Oracle-Connector
oracle.host.display=Hostname
oracle.host.help=Geben Sie den Hostnamen oder die IP-Adresse des Oracle-Servers ein
oracle.port.display=Port
oracle.port.help=Geben Sie den \u00fcberwachten Port des Oracle-Servers ein
oracle.driver.display=Treiberklasse
oracle.driver.help=Geben Sie einen Oracle-Treiberklassennamen ein
oracle.database.display=Datenbank
oracle.database.help=Geben Sie den Namen einer lokalen oder remoten Datenbank ein
oracle.user.display=Administratorkonto
oracle.user.help=Geben Sie ein Administratorkonto f\u00fcr die Verbindung zur Oracle-Ressource an
oracle.password.display=Administratorpasswort
oracle.password.help=Geben Sie das Passwort f\u00fcr das Administratorkonto f\u00fcr die Verbindung zur Oracle-Ressource an
oracle.datasource.display=JNDI-Datenquelle
oracle.datasource.help=Geben Sie den vollst\u00e4ndigen Pfadnamen des JNDI-Datenquelleneintrags ein. 
oracle.dsjndienv.display=JNDI-Umgebung der Datenquelle
oracle.dsjndienv.help=Beim Verwenden einer Datenquelle geben Sie die JNDI-Umgebungseintr\u00e4ge ein. Geben Sie Eintr\u00e4ge als Schl\u00fcssel/Wert-Paare in der Form \u201eSchl\u00fcssel1=Wert1\u201c ein, und verwenden Sie f\u00fcr jedes Schl\u00fcssel/Wert-Paar eine neue Zeile. Diese Eigenschaften werden beim Erstellen eines Erstkontextes zur Suche nach einer Datenquelle verwendet. Der Standardwert ist leer. Bei einem leeren Wert wird der lokale Kontext des Anwendungsservers verwendet. 
oracle.url.display=URL
oracle.url.help=Geben Sie die vollst\u00e4ndige JDBC-URL f\u00fcr die Verbindung mit Oracle an. Beispiel: jdbc:oracle:thin:@myhost:1521:XE
oracle.cs.display=Festlegen der Gro\u00df-/Kleinschreibung
oracle.cs.help=Geben Sie die Bedingungen f\u00fcr das Formatieren von Benutzer-Token an. F\u00fcr die Gro\u00dfschreibung aller Token au\u00dfer globalname verwenden Sie den Standardwert. Die eingegebene Zeichenkette muss folgendes Format aufweisen: Normalisierer geben an, ob Token in Gro\u00dfbuchstaben geschrieben werden, und Formatierer setzen Token in Anf\u00fchrungszeichen. Diese Token werden erkannt: USER_NAME, PASSWORD, SCHEMA, ROLE, PRIVILEGE, PROFILE, DEF_TABLESPACE, TEMP_TABLESPACE, GLOBAL_NAME.
oracle.extra.attrs.policy.display=Richtlinie f\u00fcr zus\u00e4tzliche Attribute
oracle.extra.attrs.policy.help=Geben Sie die anzuwendende Richtlinie f\u00fcr zus\u00e4tzliche Attribute bei einem gegebenen Vorgang an
								  
oracle.source.type.display=Quelltyp
oracle.source.type.help=Geben Sie den expliziten Quelltypwert ein. Ist dieser angegeben, wird nicht von au\u00dfen beeinflusst, wie der Konnektor die Verbindung zur Oracle-Datenbank herstellt. M\u00f6gliche Werte sind: [DataSource, Thin Driver, OCI Driver, Custom Driver] 			     
oracle.invalid.auth=Ung\u00fcltige Authentifizierungsoption [{0}] 
oracle.invalid.bracket=Zeichenkette [{0}] ist nicht richtig eingeklammert
oracle.illegal.right.bracket=Unzul\u00e4ssige schlie\u00dfende Klammer bei Index [{0}] f\u00fcr [{1}]
oracle.no.eq.char.in.entry=Kein '='-Zeichen in Eintrag [{0}]
oracle.char.eq.is.at.start.of.entry=Das Zeichen '=' befindet sich am Anfang des Eintrags [{0}] 
oracle.elements.for.normalizer.not.recognized=Einige Elemente in der Normalisiererkonfiguration werden nicht erkannt: {0}
oracle.elements.for.csbuilder.not.recognized=Einige Elemente f\u00fcr die Zuordnung der Gro\u00df-/Kleinschreibungskonfiguration werden nicht erkannt: {0}
oracle.error.test.user.existence=Testen der Benutzerexistenz nicht m\u00f6glich 
oracle.user.record.not.found=Der Benutzerdatensatz f\u00fcr Benutzer [{0}] kann nicht gefunden werden
oracle.update.of.user.failed=Die Aktualisierung des Benutzers [{0}] ist fehlgeschlagen
oracle.addAttributeValues.for.user.failed=Das Hinzuf\u00fcgen von Attributwerten f\u00fcr Benutzer [{0}] ist fehlgeschlagen
oracle.removeAttributeValues.for.user.failed=Das Entfernen von Attributwerten f\u00fcr Benutzer [{0}] ist fehlgeschlagen
oracle.update.attribute.not.supported=Das Attribut [{0}] wird beim Aktualisieren nicht unterst\u00fctzt
oracle.addAttributeValues.attribute.not.supported=Das Attribut [{0}] wird beim Vorgang addAttributeValues nicht unterst\u00fctzt
oracle.removeAttributeValues.attribute.not.supported=Das Attribut [{0}] wird beim Vorgang removeAttributeValues nicht unterst\u00fctzt
oracle.update.no.attributes=Es wurden keine Attribute f\u00fcr den Aktualisierungsvorgang angegeben. Geben Sie mindestens ein Attribut an
oracle.error.executing.search=Die Ausf\u00fchrung der Suchabfrage ist fehlgeschlagen
oracle.search.attribute.not.supported.for.attributesToGet=Das Attribut [{0}] wird f\u00fcr attributesToGet in der Suche nicht unterst\u00fctzt
oracle.search.attribute.not.supported.for.searchBy=Die Suche nach [{0}]-Attribut ist nicht m\u00f6glich
oracle.delete.of.user.failed=Das L\u00f6schen des Benutzers [{0}] ist fehlgeschlagen
oracle.must.specify.password.for.unexpire=Zum Festlegen eines Passworts als g\u00fcltig muss das Passwortattribut angegeben werden
oracle.create.no.attributes=Es wurden keine Attribute f\u00fcr den Erstellungsvorgang angegeben.
oracle.create.attribute.not.supported=Das Attribut [{0}] wird beim Erstellen nicht unterst\u00fctzt
oracle.create.of.user.failed=Das Erstellen des Benutzers [{0}] ist fehlgeschlagen
oracle.missing.default.tablespace.for.quota=Standardtabellenraum fehlt, Quote kann nicht festgelegt werden 
oracle.missing.temporary.tablespace.for.quota=Tempor\u00e4rer Tabellenraum fehlt, Quote kann nicht festgelegt werden 
oracle.cannot.set.globalname.for.not.global.authentication=Globalname kann nicht f\u00fcr die globale Authentifizierung festgelegt werden
oracle.cannot.set.password.for.not.local.authentication=Das Passwort kann nicht f\u00fcr die lokale Authentifizierung festgelegt werden
oracle.cannot.expire.password.for.not.local.authentication=Das Passwort kann f\u00fcr die nicht-lokale Authentifizierung nicht als abgelaufen festgelegt werden
oracle.missing.globalname.for.global.authentication=GlobalName wurde f\u00fcr die globale Authentifizierung nicht angegeben
oracle.boolean.attribute.has.invalid.value=Das boolesche Attribut [{0}] besitzt den ung\u00fcltigen Wert [{1}]
oracle.attribute.is.empty=Das Attribut [{0}] ist leer
oracle.attribute.is.missing=Das Attribut [{0}] fehlt
oracle.set.driver.or.url=Es muss ein Thin- oder OCI- oder benutzerdefinierter Treiber mit der vollst\u00e4ndigen JDBC-URL angegeben werden
oracle.cannot.load.driver=Treiberklasse kann nicht geladen werden: [{0}]
oracle.user.and.password.must.be.set.both.or.none=Legen Sie entweder Benutzer und Passwort oder weder noch fest
oracle.thin.connection.error=Mit dem Thin-Treiber kann keine Verbindung hergestellt werden. Ursache: {0}
oracle.oci.connection.error=Mit dem OCI-Treiber kann keine Verbindung hergestellt werden. Ursache: {0}
oracle.custom.connection.error=Mit dem benutzerdefinierten Treiber oder der URL kann keine Verbindung hergestellt werden. Ursache: {0}
oracle.datasource.connection.error=Es kann keine Verbindung von der Datenquelle aus hergestellt werden. Ursache: {0}
oracle.enable.lock.attr.value.conflict.false=Die Attribute Enable und Lock_out k\u00f6nnen nicht beide den Wert "false" besitzen. Es ist nicht m\u00f6glich, einen Benutzer gleichzeitig zu deaktivieren und dessen Sperre aufzuheben 
oracle.enable.lock.attr.value.conflict.true=Die Attribute Enable und Lock_out k\u00f6nnen nicht beide den Wert "true" besitzen. Es ist nicht m\u00f6glich, einen Benutzer gleichzeitig zu aktivieren und zu sperren 
oracle.invalid.source.type=Ung\u00fcltiger Quelltyp. [DataSource,Custom Driver,Thin Driver,OCI Driver] muss angegeben werden 
oracle.cs.must.specify.one.array.element=Zum Analysieren der Gro\u00df-/Kleinschreibung muss genau ein Attribut pro Array-Element angegeben werden
oracle.eap.must.specify.one.array.element=Zum Analysieren der Richtlinien f\u00fcr zus\u00e4tzliche Attribute muss genau ein Attribut pro Array-Element angegeben werden
oracle.eap.invalid.elements.in.map=Ung\u00fcltige Elemente in der Zuordnung der Richtlinie f\u00fcr zus\u00e4tzliche Attribute: [{0}] 
oracle.eap.cannot.resolve.spi.operation=SPIOperation f\u00fcr Zeichenkette [{0}] kann nicht aufgel\u00f6st werden
