oracle.connector.display=Oracle \u30b3\u30cd\u30af\u30bf
oracle.host.display=\u30db\u30b9\u30c8\u540d
oracle.host.help=Oracle \u30b5\u30fc\u30d0\u30fc\u306e\u30db\u30b9\u30c8\u540d\u307e\u305f\u306f IP \u30a2\u30c9\u30ec\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059
oracle.port.display=\u30dd\u30fc\u30c8
oracle.port.help=Oracle \u30b5\u30fc\u30d0\u30fc\u306e\u5f85\u6a5f\u30dd\u30fc\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059
oracle.driver.display=\u30c9\u30e9\u30a4\u30d0\u30af\u30e9\u30b9
oracle.driver.help=Oracle \u30c9\u30e9\u30a4\u30d0\u30af\u30e9\u30b9\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059
oracle.database.display=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9
oracle.database.help=\u30ed\u30fc\u30ab\u30eb\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u307e\u305f\u306f\u30ea\u30e2\u30fc\u30c8\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059
oracle.user.display=\u7ba1\u7406\u30a2\u30ab\u30a6\u30f3\u30c8
oracle.user.help=Oracle \u30ea\u30bd\u30fc\u30b9\u306b\u63a5\u7d9a\u3059\u308b\u7ba1\u7406\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059
oracle.password.display=\u7ba1\u7406\u30d1\u30b9\u30ef\u30fc\u30c9
oracle.password.help=Oracle \u30ea\u30bd\u30fc\u30b9\u306b\u63a5\u7d9a\u3059\u308b\u7ba1\u7406\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059
oracle.datasource.display=JNDI \u30c7\u30fc\u30bf\u30bd\u30fc\u30b9
oracle.datasource.help=JNDI \u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u30a8\u30f3\u30c8\u30ea\u306e\u30d5\u30eb\u30d1\u30b9\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
oracle.dsjndienv.display=\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9 JNDI \u74b0\u5883
oracle.dsjndienv.help=\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u3068\u304d\u306e JNDI \u74b0\u5883\u30a8\u30f3\u30c8\u30ea\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u30a8\u30f3\u30c8\u30ea\u306f\u30ad\u30fc\u3068\u5024\u306e\u30da\u30a2\u3068\u3057\u3066\u3001"key1=value1" \u306e\u5f62\u5f0f\u3067 1 \u884c\u306b 1 \u3064\u305a\u3064\u6307\u5b9a\u3057\u307e\u3059\u3002\u3053\u308c\u3089\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u3001\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u691c\u7d22\u306e\u521d\u671f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u4f5c\u6210\u6642\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f\u7a7a\u3067\u3059\u3002\u7a7a\u306e\u5834\u5408\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u306e\u30ed\u30fc\u30ab\u30eb\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
oracle.url.display=URL
oracle.url.help=Oracle \u306b\u63a5\u7d9a\u3059\u308b\u5b8c\u5168\u306a JDBC URL \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u305f\u3068\u3048\u3070\u3001jdbc:oracle:thin:@myhost:1521:XE \u306a\u3069\u3067\u3059
oracle.cs.display=\u5927\u6587\u5b57\u3068\u5c0f\u6587\u5b57\u306e\u533a\u5225\u306e\u8a2d\u5b9a
oracle.cs.help=\u30e6\u30fc\u30b6\u30fc\u30c8\u30fc\u30af\u30f3\u306e\u5f62\u5f0f\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002\u30b0\u30ed\u30fc\u30d0\u30eb\u540d\u3092\u9664\u304f\u3059\u3079\u3066\u306e\u30c8\u30fc\u30af\u30f3\u3092\u5927\u6587\u5b57\u306b\u3059\u308b\u5834\u5408\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306b\u8a2d\u5b9a\u3057\u307e\u3059\u3002\u5165\u529b\u6587\u5b57\u5217\u306f\u3053\u306e\u5f62\u5f0f\u3067\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30ce\u30fc\u30de\u30e9\u30a4\u30b6\u306f\u30c8\u30fc\u30af\u30f3\u3092\u5927\u6587\u5b57\u3067\u5165\u529b\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u3001\u30d5\u30a9\u30fc\u30de\u30c3\u30bf\u306f\u30c8\u30fc\u30af\u30f3\u3092\u5f15\u7528\u7b26\u3067\u56f2\u307f\u307e\u3059\u3002\u8a8d\u8b58\u3055\u308c\u308b\u30c8\u30fc\u30af\u30f3\u306f\u3001USER_NAME\u3001PASSWORD\u3001SCHEMA\u3001ROLE\u3001PRIVILEGE\u3001PROFILE\u3001DEF_TABLESPACE\u3001TEMP_TABLESPACE\u3001GLOBAL_NAME \u3067\u3059\u3002
oracle.extra.attrs.policy.display=\u8ffd\u52a0\u5c5e\u6027\u30dd\u30ea\u30b7\u30fc
oracle.extra.attrs.policy.help=\u64cd\u4f5c\u306b\u8ffd\u52a0\u5c5e\u6027\u304c\u3042\u308b\u3068\u304d\u306b\u9069\u7528\u3059\u308b\u30dd\u30ea\u30b7\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
								  
oracle.source.type.display=\u30bd\u30fc\u30b9\u30bf\u30a4\u30d7
oracle.source.type.help=\u660e\u793a\u7684\u306a\u30bd\u30fc\u30b9\u30bf\u30a4\u30d7\u306e\u5024\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u5024\u3092\u6307\u5b9a\u3057\u305f\u5834\u5408\u3001\u30b3\u30cd\u30af\u30bf\u3068 Oracle \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u63a5\u7d9a\u306f\u5e72\u6e09\u3092\u53d7\u3051\u307e\u305b\u3093\u3002\u6307\u5b9a\u3067\u304d\u308b\u5024: [DataSource\u3001Thin Driver\u3001OCI Driver\u3001Custom Driver]			     
oracle.invalid.auth=\u7121\u52b9\u306a\u8a8d\u8a3c\u30aa\u30d7\u30b7\u30e7\u30f3 [{0}]
oracle.invalid.bracket=\u6587\u5b57\u5217 [{0}] \u306f\u6b63\u3057\u304f\u62ec\u5f27\u3067\u56f2\u307e\u308c\u3066\u3044\u307e\u305b\u3093
oracle.illegal.right.bracket=[{1}] \u306e\u30a4\u30f3\u30c7\u30c3\u30af\u30b9 [{0}] \u3067\u3001\u53f3\u306e\u62ec\u5f27\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093
oracle.no.eq.char.in.entry=\u30a8\u30f3\u30c8\u30ea [{0}] \u306b '=' \u6587\u5b57\u304c\u3042\u308a\u307e\u305b\u3093
oracle.char.eq.is.at.start.of.entry=\u30a8\u30f3\u30c8\u30ea [{0}] \u304c '=' \u6587\u5b57\u3067\u59cb\u307e\u3063\u3066\u3044\u307e\u3059
oracle.elements.for.normalizer.not.recognized=\u30ce\u30fc\u30de\u30e9\u30a4\u30b6\u306e\u8a2d\u5b9a\u306b\u8a8d\u8b58\u3067\u304d\u306a\u3044\u8981\u7d20\u304c\u3042\u308a\u307e\u3059: {0}
oracle.elements.for.csbuilder.not.recognized=\u5927\u6587\u5b57\u3068\u5c0f\u6587\u5b57\u306e\u533a\u5225\u306e\u8a2d\u5b9a\u30de\u30c3\u30d7\u306b\u8a8d\u8b58\u3067\u304d\u306a\u3044\u8981\u7d20\u304c\u3042\u308a\u307e\u3059: {0}
oracle.error.test.user.existence=\u30c6\u30b9\u30c8\u30e6\u30fc\u30b6\u30fc\u306f\u5b58\u5728\u3067\u304d\u307e\u305b\u3093
oracle.user.record.not.found=\u30e6\u30fc\u30b6\u30fc [{0}] \u306e\u30e6\u30fc\u30b6\u30fc\u30ec\u30b3\u30fc\u30c9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
oracle.update.of.user.failed=\u30e6\u30fc\u30b6\u30fc [{0}] \u306e\u66f4\u65b0\u306b\u5931\u6557\u3057\u307e\u3057\u305f
oracle.addAttributeValues.for.user.failed=\u30e6\u30fc\u30b6\u30fc [{0}] \u306e\u5c5e\u6027\u5024\u306e\u8ffd\u52a0\u306b\u5931\u6557\u3057\u307e\u3057\u305f
oracle.removeAttributeValues.for.user.failed=\u30e6\u30fc\u30b6\u30fc [{0}] \u306e\u5c5e\u6027\u5024\u306e\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f
oracle.update.attribute.not.supported=\u66f4\u65b0\u3067\u306f\u5c5e\u6027 [{0}] \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093
oracle.addAttributeValues.attribute.not.supported=addAttributeValues \u64cd\u4f5c\u3067\u306f\u5c5e\u6027 [{0}] \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093
oracle.removeAttributeValues.attribute.not.supported=removeAttributeValues \u64cd\u4f5c\u3067\u306f\u5c5e\u6027 [{0}] \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093
oracle.update.no.attributes=\u66f4\u65b0\u306b\u5bfe\u3057\u3066\u5c5e\u6027\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5c5e\u6027\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044
oracle.error.executing.search=\u691c\u7d22\u30af\u30a8\u30ea\u30fc\u306e\u5b9f\u884c\u306b\u5931\u6557\u3057\u307e\u3057\u305f
oracle.search.attribute.not.supported.for.attributesToGet=\u691c\u7d22\u306e attributesToGet \u3067\u306f\u5c5e\u6027 [{0}] \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093
oracle.search.attribute.not.supported.for.searchBy=[{0}] \u5c5e\u6027\u3067\u306f\u691c\u7d22\u3067\u304d\u307e\u305b\u3093
oracle.delete.of.user.failed=\u30e6\u30fc\u30b6\u30fc [{0}] \u306e\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f
oracle.must.specify.password.for.unexpire=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u671f\u9650\u5207\u308c\u3092\u89e3\u9664\u3059\u308b\u306b\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
oracle.create.no.attributes=\u4f5c\u6210\u306b\u5bfe\u3057\u3066\u5c5e\u6027\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093
oracle.create.attribute.not.supported=\u4f5c\u6210\u3067\u306f\u5c5e\u6027 [{0}] \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093
oracle.create.of.user.failed=\u30e6\u30fc\u30b6\u30fc [{0}] \u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f
oracle.missing.default.tablespace.for.quota=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30c6\u30fc\u30d6\u30eb\u30b9\u30da\u30fc\u30b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u5236\u9650\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093
oracle.missing.temporary.tablespace.for.quota=\u4e00\u6642\u30c6\u30fc\u30d6\u30eb\u30b9\u30da\u30fc\u30b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u5236\u9650\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093
oracle.cannot.set.globalname.for.not.global.authentication=\u30b0\u30ed\u30fc\u30d0\u30eb\u8a8d\u8a3c\u4ee5\u5916\u3067\u306f\u30b0\u30ed\u30fc\u30d0\u30eb\u540d\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093
oracle.cannot.set.password.for.not.local.authentication=\u30ed\u30fc\u30ab\u30eb\u8a8d\u8a3c\u4ee5\u5916\u3067\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093
oracle.cannot.expire.password.for.not.local.authentication=\u30ed\u30fc\u30ab\u30eb\u8a8d\u8a3c\u4ee5\u5916\u3067\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u671f\u9650\u5207\u308c\u306b\u3067\u304d\u307e\u305b\u3093
oracle.missing.globalname.for.global.authentication=\u30b0\u30ed\u30fc\u30d0\u30eb\u8a8d\u8a3c\u306b\u30b0\u30ed\u30fc\u30d0\u30eb\u540d\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093
oracle.boolean.attribute.has.invalid.value=\u30d6\u30fc\u30eb\u5c5e\u6027 [{0}] \u306b\u7121\u52b9\u306a\u5024 [{1}] \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059
oracle.attribute.is.empty=\u5c5e\u6027 [{0}] \u304c\u7a7a\u3067\u3059
oracle.attribute.is.missing=\u5c5e\u6027 [{0}] \u304c\u3042\u308a\u307e\u305b\u3093
oracle.set.driver.or.url=thin \u307e\u305f\u306f oci \u30c9\u30e9\u30a4\u30d0\u304b\u3001\u30ab\u30b9\u30bf\u30e0\u30c9\u30e9\u30a4\u30d0\u3092\u5b8c\u5168\u306a JDBC URL \u3067\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
oracle.cannot.load.driver=\u30c9\u30e9\u30a4\u30d0\u30af\u30e9\u30b9\u3092\u8aad\u307f\u8fbc\u3081\u307e\u305b\u3093: [{0}]
oracle.user.and.password.must.be.set.both.or.none=\u30e6\u30fc\u30b6\u30fc\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u4e21\u65b9\u3092\u8a2d\u5b9a\u3059\u308b\u304b\u3001\u3069\u3061\u3089\u3082\u8a2d\u5b9a\u3057\u307e\u305b\u3093
oracle.thin.connection.error=thin \u30c9\u30e9\u30a4\u30d0\u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002\u539f\u56e0: {0}
oracle.oci.connection.error=oci \u30c9\u30e9\u30a4\u30d0\u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002\u539f\u56e0: {0}
oracle.custom.connection.error=\u30ab\u30b9\u30bf\u30e0\u30c9\u30e9\u30a4\u30d0\u307e\u305f\u306f URL \u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002\u539f\u56e0: {0}
oracle.datasource.connection.error=\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u304b\u3089\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002\u539f\u56e0: {0}
oracle.enable.lock.attr.value.conflict.false=Enable \u5c5e\u6027\u3068 Lock_out \u5c5e\u6027\u306e\u4e21\u65b9\u306b false \u5024\u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30e6\u30fc\u30b6\u30fc\u306e\u7121\u52b9\u5316\u3068\u30ed\u30c3\u30af\u89e3\u9664\u3092\u540c\u6642\u306b\u884c\u3046\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
oracle.enable.lock.attr.value.conflict.true=Enable \u5c5e\u6027\u3068 Lock_out \u5c5e\u6027\u306e\u4e21\u65b9\u306b true \u5024\u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30e6\u30fc\u30b6\u30fc\u306e\u6709\u52b9\u5316\u3068\u30ed\u30c3\u30af\u3092\u540c\u6642\u306b\u884c\u3046\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
oracle.invalid.source.type=\u7121\u52b9\u306a\u30bd\u30fc\u30b9\u30bf\u30a4\u30d7\u3067\u3059\u3002DataSource\u3001Custom Driver\u3001Thin Driver\u3001OCI Driver \u306e\u3044\u305a\u308c\u304b\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059 
oracle.cs.must.specify.one.array.element=\u5927\u6587\u5b57\u3068\u5c0f\u6587\u5b57\u306e\u533a\u5225\u3092\u89e3\u6790\u3059\u308b\u5834\u5408\u3001\u914d\u5217\u8981\u7d20\u3054\u3068\u306b\u5c5e\u6027\u3092 1 \u3064\u3060\u3051\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
oracle.eap.must.specify.one.array.element=\u8ffd\u52a0\u5c5e\u6027\u30dd\u30ea\u30b7\u30fc\u3092\u89e3\u6790\u3059\u308b\u5834\u5408\u3001\u914d\u5217\u8981\u7d20\u3054\u3068\u306b\u5c5e\u6027\u3092 1 \u3064\u3060\u3051\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
oracle.eap.invalid.elements.in.map=\u8ffd\u52a0\u5c5e\u6027\u30dd\u30ea\u30b7\u30fc\u30de\u30c3\u30d7\u306b\u7121\u52b9\u306a\u8981\u7d20 [{0}] \u304c\u3042\u308a\u307e\u3059
oracle.eap.cannot.resolve.spi.operation=\u6587\u5b57\u5217 [{0}] \u306e SPIOperation \u3092\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093
