oracle.connector.display=Conector Oracle
oracle.host.display=Nome do host
oracle.host.help=Especifique o nome do host ou o endere\u00e7o IP do servidor Oracle
oracle.port.display=Porta
oracle.port.help=Especifique a porta de escuta do servidor Oracle
oracle.driver.display=Classe de driver
oracle.driver.help=Especifique o nome de uma classe de driver Oracle
oracle.database.display=Banco de dados
oracle.database.help=Especifique o nome de um banco de dados local ou remoto
oracle.user.display=Conta de administra\u00e7\u00e3o
oracle.user.help=Especifique uma conta de administra\u00e7\u00e3o para conex\u00e3o com o recurso Oracle 
oracle.password.display=Senha de administra\u00e7\u00e3o
oracle.password.help=Especifique a senha da conta de administra\u00e7\u00e3o para conex\u00e3o com o recurso Oracle 
oracle.datasource.display=Fonte de dados JNDI
oracle.datasource.help=Especifique o nome de caminho completo da entrada de fonte de dados JNDI.
oracle.dsjndienv.display=Ambiente JNDI da fonte de dados
oracle.dsjndienv.help=Especifique as entradas de ambiente JNDI ao usar uma fonte de dados.  Especifique entradas como pares de chave/valor no formato "chave1=valor1", com cada par de chave/valor em uma nova linha.  Essas propriedades s\u00e3o usadas ao se criar um contexto inicial para a pesquisa de uma fonte de dados.  O valor padr\u00e3o \u00e9 vazio. Se vazio, ser\u00e1 usado o contexto local do servidor de aplicativos.
oracle.url.display=URL
oracle.url.help=Especifique o URL JDBC completo para conex\u00e3o com o Oracle. Por exemplo: jdbc:oracle:thin:@myhost:1521:XE
oracle.cs.display=Configura\u00e7\u00e3o da distin\u00e7\u00e3o entre mai\u00fasculas e min\u00fasculas
oracle.cs.help=Especifique a configura\u00e7\u00e3o para formatar tokens do usu\u00e1rio. Defina como valor padr\u00e3o para colocar em mai\u00fasculas todos os tokens, exceto globalname. A seq\u00fc\u00eancia de entrada deve ser especificada neste formato: Os normalizadores especificam se o token deve ser inserido em mai\u00fasculas e os formatadores colocam o token entre aspas. Estes tokens s\u00e3o reconhecidos: USER_NAME, PASSWORD, SCHEMA, ROLE, PRIVILEGE, PROFILE, DEF_TABLESPACE, TEMP_TABLESPACE, GLOBAL_NAME.
oracle.extra.attrs.policy.display=Pol\u00edtica de atributos extras
oracle.extra.attrs.policy.help=Especifique a pol\u00edtica a ser aplicada quando houver atributos extras em determinada opera\u00e7\u00e3o
								  
oracle.source.type.display=Tipo de fonte
oracle.source.type.help=Especifique o valor de tipo de fonte expl\u00edcito. Quando especificado, n\u00e3o interferimos na maneira como o conector se conectar\u00e1 ao banco de dados Oracle. Os valores poss\u00edveis s\u00e3o: [DataSource, Thin Driver, OCI Driver, Custom Driver]			     
oracle.invalid.auth=Op\u00e7\u00e3o de autentica\u00e7\u00e3o inv\u00e1lida [{0}]
oracle.invalid.bracket=A seq\u00fc\u00eancia [{0}] n\u00e3o est\u00e1 corretamente entre colchetes.
oracle.illegal.right.bracket=Colchete direito ilegal no \u00edndice [{0}] para [{1}]
oracle.no.eq.char.in.entry=Nenhum caractere '=' na entrada [{0}]
oracle.char.eq.is.at.start.of.entry=O caractere '=' est\u00e1 no in\u00edcio da entrada [{0}]
oracle.elements.for.normalizer.not.recognized=Alguns elementos n\u00e3o reconhecidos na configura\u00e7\u00e3o de normalizadores: {0}
oracle.elements.for.csbuilder.not.recognized=Alguns elementos n\u00e3o reconhecidos no mapa de configura\u00e7\u00e3o da distin\u00e7\u00e3o entre mai\u00fasculas e min\u00fasculas: {0}
oracle.error.test.user.existence=N\u00e3o \u00e9 poss\u00edvel testar a exist\u00eancia do usu\u00e1rio
oracle.user.record.not.found=Registro do usu\u00e1rio n\u00e3o encontrado para o usu\u00e1rio [{0}]
oracle.update.of.user.failed=Falha ao atualizar o usu\u00e1rio [{0}]
oracle.addAttributeValues.for.user.failed=Falha ao adicionar valores de atributos para o usu\u00e1rio [{0}]
oracle.removeAttributeValues.for.user.failed=Falha ao remover valores de atributos para o usu\u00e1rio [{0}]
oracle.update.attribute.not.supported=Atributo [{0}] sem suporte para atualiza\u00e7\u00e3o
oracle.addAttributeValues.attribute.not.supported=Atributo [{0}] sem suporte para opera\u00e7\u00e3o addAttributeValues
oracle.removeAttributeValues.attribute.not.supported=Atributo [{0}] sem suporte para opera\u00e7\u00e3o removeAttributeValues
oracle.update.no.attributes=Nenhum atributo presente para atualiza\u00e7\u00e3o. Especifique pelo menos um atributo
oracle.error.executing.search=Falha na execu\u00e7\u00e3o da consulta de pesquisa
oracle.search.attribute.not.supported.for.attributesToGet=Atributo [{0}] sem suporte para attributesToGet em pesquisa
oracle.search.attribute.not.supported.for.searchBy=N\u00e3o \u00e9 poss\u00edvel pesquisar pelo atributo [{0}]
oracle.delete.of.user.failed=Falha ao excluir o usu\u00e1rio [{0}]
oracle.must.specify.password.for.unexpire=\u00c9 preciso especificar o atributo de senha para que a senha n\u00e3o expire
oracle.create.no.attributes=Nenhum atributo presente para cria\u00e7\u00e3o
oracle.create.attribute.not.supported=Atributo [{0}] sem suporte para cria\u00e7\u00e3o
oracle.create.of.user.failed=Falha ao criar o usu\u00e1rio [{0}]
oracle.missing.default.tablespace.for.quota=Est\u00e1 faltando o espa\u00e7o de tabela padr\u00e3o; n\u00e3o \u00e9 poss\u00edvel definir a cota
oracle.missing.temporary.tablespace.for.quota=Est\u00e1 faltando o espa\u00e7o de tabela tempor\u00e1rio; n\u00e3o \u00e9 poss\u00edvel definir a cota
oracle.cannot.set.globalname.for.not.global.authentication=Globalname n\u00e3o pode ser definido para autentica\u00e7\u00e3o n\u00e3o global
oracle.cannot.set.password.for.not.local.authentication=A senha n\u00e3o pode ser definida para autentica\u00e7\u00e3o n\u00e3o local
oracle.cannot.expire.password.for.not.local.authentication=A senha para autentica\u00e7\u00e3o n\u00e3o local n\u00e3o pode expirar
oracle.missing.globalname.for.global.authentication=GlobalName n\u00e3o especificado para autentica\u00e7\u00e3o global
oracle.boolean.attribute.has.invalid.value=O atributo booleano [{0}] tem valor inv\u00e1lido [{1}]
oracle.attribute.is.empty=O atributo [{0}] est\u00e1 vazio
oracle.attribute.is.missing=Est\u00e1 faltando o atributo [{0}]
oracle.set.driver.or.url=\u00c9 preciso especificar o driver thin, oci ou personalizado com o URL jdbc completo
oracle.cannot.load.driver=N\u00e3o \u00e9 poss\u00edvel carregar a classe de driver: [{0}]
oracle.user.and.password.must.be.set.both.or.none=Definir usu\u00e1rio e senha, ambos ou nenhum
oracle.thin.connection.error=N\u00e3o \u00e9 poss\u00edvel criar a conex\u00e3o usando o driver thin. Causa: {0}
oracle.oci.connection.error=N\u00e3o \u00e9 poss\u00edvel criar a conex\u00e3o usando o driver oci. Causa: {0}
oracle.custom.connection.error=N\u00e3o \u00e9 poss\u00edvel criar a conex\u00e3o usando o driver personalizado ou o URL. Causa: {0}
oracle.datasource.connection.error=N\u00e3o \u00e9 poss\u00edvel criar a conex\u00e3o a partir da fonte de dados. Causa: {0}
oracle.enable.lock.attr.value.conflict.false=O atributo Enable e o atributo Lock_out n\u00e3o podem ter ambos o valor "false". N\u00e3o podemos desativar e desbloquear o usu\u00e1rio ao mesmo tempo
oracle.enable.lock.attr.value.conflict.true=O atributo Enable e o atributo Lock_out n\u00e3o podem ter ambos o valor "true". N\u00e3o podemos ativar e bloquear o usu\u00e1rio ao mesmo tempo
oracle.invalid.source.type=Tipo de fonte inv\u00e1lido \u00c9 preciso especificar [DataSource,Custom Driver,Thin Driver,OCI Driver] 
oracle.cs.must.specify.one.array.element=\u00c9 preciso especificar exatamente um atributo por elemento de matriz para an\u00e1lise da distin\u00e7\u00e3o entre mai\u00fasculas e min\u00fasculas
oracle.eap.must.specify.one.array.element=\u00c9 preciso especificar exatamente um atributo por elemento de matriz para an\u00e1lise da pol\u00edtica de atributos extras
oracle.eap.invalid.elements.in.map=Elementos inv\u00e1lidos no mapa da pol\u00edtica de atributos extras: [{0}]
oracle.eap.cannot.resolve.spi.operation=N\u00e3o \u00e9 poss\u00edvel resolver SPIOperation para a seq\u00fc\u00eancia: [{0}]
