# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
## This file maps the annoted display keys from your source files (such as @ConnectorClass
## and @ConfigurationProperty) to their string values for display in the application's UI

oracleerp.connector.display=Conector de ERP de Oracle 
DATA_SOURCE_DISPLAY=Nombre/Ruta de origen de datos JDBC
DATA_SOURCE_HELP=<b>Nombre/Ruta de origen de datos JDBC</b><br>Introduzca el Nombre/Ruta de origen de datos JDBC para conectar al servidor Oracle. Si se lo especifica, el adaptador s\u00f3lo tratar\u00e1 de conectarse utilizando el origen de datos (Datasource) e ignorar\u00e1 otros par\u00e1metros de recurso especificados.
JNDI_PROPERTIES_DISPLAY=Propiedades de JNDI iniciales
JNDI_PROPERTIES_HELP=<b>Propiedades de JNDI iniciales</b><br>Se puede dejar vac\u00edo o introducir el proveedor de contexto inicial de f\u00e1brica JDBC JNDI con el formato: clave = valor.
CONN_URL_DISPLAY=URL de conexi\u00f3n
CONN_URL_HELP=<b>URL de conexi\u00f3n</b><br>Introduzca la url de conexi\u00f3n JDBC para conectarse al servidor Oracle. Requerida si se especifica un controlador de terceros. Ignorada si se especifica <b>DataSource</b>.
DRIVER_DISPLAY=Controlador JDBC
DRIVER_HELP=<b>Controlador</b><br>Introduzca el nombre de clase del controlador JDBC que se deba conectar al servidor Oracle. El tipo predeterminado de controlador es el <b>delgado</b>.
HOST_NAME_DISPLAY=Host
HOST_NAME_HELP=<b>Host</b><br>Introduzca el nombre del host que est\u00e1 ejecutando el servidor de Oracle.  No requerido si se encuentra especificado en <b>URL de conexi\u00f3n</b>.
PORT_DISPLAY=Puerto de base de datos
PORT_HELP=<b>puerto</b><br>Especifique el puerto de base de datos utilizado para la comunicaci\u00f3n con el servidor Oracle. No requerido si se encuentra especificado en <b>URL de conexi\u00f3n</b>.
DATABASE_NAME_DISPLAY=Base de datos
DATABASE_NAME_HELP=<b>Base de datos</b><br>Especifique el nombre de la base de datos.
USER_DISPLAY=Usuario
USER_HELP=<b>usuario</b><br>Especifique el usuario administrativo o deje el campo vac\u00edo si no se necesita usuario administrativo.
PASSWORD_DISPLAY=Contrase\u00f1a
PASSWORD_HELP=<b>contrase\u00f1a</b><br>Introduzca la contrase\u00f1a que se deba utilizar cuando se autentique en la base de datos Oracle.
AUDIT_RESPONSIBILITY_DISPLAY=Responsabilidad del usuario administrador de ERP de Oracle
AUDIT_RESPONSIBILITY_HELP=<b>Responsabilidad del usuario administrador de ERP de Oracle</b><br>Escriba la responsabilidad de administraci\u00f3n que desee para el m\u00f3dulo ERP de Oracle.
MANAGE_SECURING_ATTRS_DISPALY=Administrar atributos de seguridad
MANAGE_SECURING_ATTRS_HELP=<b>Administrar atributos de seguridad</b><br>: introduzca el valor 'TRUE' verdadero para administrar los atributos de seguridad o 'FALSE' falso para omitir el atributo de esquema.
RETURN_SOB_AND_ORG_DISPLAY=Devolver conjunto de libros u organizaci\u00f3n
RETURN_SOB_AND_ORG_HELP=<b>Devolver conjunto de libros u organizaci\u00f3n</b><br>Introduzca el valor 'TRUE' verdadero para devolver el conjunto de libros o la organizaci\u00f3n asociados con el atributo de objeto de responsabilidad de auditor; o bien introduzca el valor 'FALSE' falso si no se requiere conjunto de libros (SOB) ni organizaci\u00f3n (Org). El valor 'FALSE' falso mejorar\u00e1 el rendimiento.
ACTIVE_ACCOUNTS_ONLY_DISPLAY=S\u00f3lo cuentas activas
ACTIVE_ACCOUNTS_ONLY_HELP=<b>S\u00f3lo cuentas activas</b><br>Def\u00ednalo en el valor 'TRUE' verdadero para limitar las cuentas devueltas por el iterador de cuentas e interfaces listObjects. Si se define en 'TRUE' verdadero, s\u00f3lo se devolver\u00e1n las cuentas con START_DATE y END_DATE que abarquen el valor de SYSDATE. El valor predeterminado es 'FALSE' falso; en este caso, se devuelven todas las cuentas del recurso.
ACCOUNTS_INCLUDED_DISPLAY=Inclusi\u00f3n de cuenta
ACCOUNTS_INCLUDED_HELP=Cl\u00e1usula SQL "WHERE" para identificar las cuentas que administrar\u00e1 IDM. Se ignora el par\u00e1metro 'Active Accounts Only' (s\u00f3lo cuentas activas).
AFTER_ACTION_DISPLAY=Acci\u00f3n para 'GetUser' (obtenci\u00f3n de usuario)
AFTER_ACTION_HELP=<b>Acci\u00f3n para 'GetUser' (obtenci\u00f3n de usuario)</b><br>(Opcional) Introduzca el nombre de la acci\u00f3n de recurso que contiene la secuencia de comandos usada para recuperar m\u00e1s atributos de cuenta personalizados para un usuario de este recurso.
NO_SCHEMA_ID_DISPLAY=No utilizar identificador de esquema
NO_SCHEMA_ID_HELP=<b>No utilizar identificador de esquema</b></br>Si este valor es verdadero, el identificador de esquema no se utilizar\u00e1 como prefijo en los nombres de tabla. Si es falso, se utilizar\u00e1 un identificador de esquema como prefijo en los nombres de tabla. El valor predeterminado es falso.
CLIENT_ENCRYPTION_ALGORITHMS_DISPLAY=Tipos de cifrado de cliente de Oracle
CLIENT_ENCRYPTION_ALGORITHMS_HELP=<b>Algoritmo(s) de cifrado de Oracle v\u00e1lidos</b><br>Introduzca un algoritmo o una lista de algoritmos de cifrado de Oracle v\u00e1lidos,<br> por ejemplo, <b>RC4_256</b>, <b>RC4_128</b>, <b>RC4_56C</b>, <b>RC4_40</b>, <b>DES56C</b>, <b>DESC40</b>.
CLIENT_ENCRYPTION_LEVEL_DISPLAY=Nivel de cifrado de cliente de Oracle
CLIENT_ENCRYPTION_LEVEL_HELP=<b>Nivel de cifrado de cliente de Oracle</b><br>Escriba el nivel deseado de requisitos obligatorios de cifrado de Oracle; por ejemplo, <b>REJECTED</b>, <b>ACCEPTED</b>, <b>REQUESTED</b> o <b>REQUIRED</b> (rechazado, aceptado, solicitado, necesario).
USER_AFTER_ACTION_SCRIPT_DISPLAY=Introduzca la secuencia de comandos Acci\u00f3n despu\u00e9s de getUser 
USER_AFTER_ACTION_SCRIPT_HELP=<b>Secuencia de comandos Acci\u00f3n despu\u00e9s de getUser</b>
ACTION_SCRIPT_LANGUAGE_DISPLAY=introduzca el lenguaje de secuencias de comandos de Acci\u00f3n
ACTION_SCRIPT_LANGUAGE_HELP=<b>Lenguaje de secuencias de comandos de Acci\u00f3n</b></br>El lenguaje de secuencias de comandos de Acci\u00f3n puede ser JAVSCRIPT, BEANSHELL, GROOVY.

msg.user.blank=El atributo de configuraci\u00f3n de usuario no puede quedar vac\u00edo.
msg.password.blank=El atributo de contrase\u00f1a no puede quedar vac\u00edo.
msg.host.blank=La propiedad de configuraci\u00f3n de host no puede quedar vac\u00eda.
msg.port.blank=La propiedad de configuraci\u00f3n de puerto no puede quedar vac\u00eda.
msg.database.blank=La propiedad de configuraci\u00f3n de base de datos no puede quedar vac\u00eda.
msg.driver.blank=La propiedad de configuraci\u00f3n de controlador no puede quedar vac\u00eda.
msg.jdbc.driver.not.found=El controlador JDBC no se ha encontrado en la ruta de clase.
msg.unknown.operation.type=La operaci\u00f3n requiere una clase 'ObjectClass' desconocida: ''{0}''
msg.account.not.read=No se puede leer la cuenta ''{0}''.
msg.account.not.create=No se puede crear la  cuenta ''{0}''.
msg.account.not.update=No se puede actualizar la cuenta ''{0}''. 
msg.account.not.delete=No se puede eliminar la cuenta ''{0}''.
msg.could.not.enable.user=No se ha podido habilitar el usuario ''{0}''.
msg.could.not.disable.user=No se ha podido inhabilitar el usuario ''{0}''.
msg.could.not.rename.user=No se ha podido cambiar el nombre del usuario ''{0}'' por ''{1}''.
msg.acount.name.required=Falta el nombre de cuenta necesario.
msg.acount.uid.required=Falta el uid de cuenta necesario.
msg.auth.op.failed=Ha fallado la autenticaci\u00f3n del usuario {0}.
msg.could.not.read=No se ha podido leer el objeto
msg.hr.linking.error=No se ha encontrado el Id de persona (person_id) del error, utilizando el n\u00famero de empleado (employee_number) "{0}''. Usuario "{1}" no creado.
msg.user.not.found=No se ha encontrado el Id de usuario (User_Id) de la identidad ''{0}''.
msg.invalid.responsibility=Responsabilidad no v\u00e1lida: ''{0}''.
msg.could.not.execute=No se ha podido ejecutar la instrucci\u00f3n: {0}.
msg.failed.add.responsibility=No se ha podido agregar la responsabilidad ''{0}'': {1}.
msg.failed.delete.responsibility=No se ha podido eliminar la responsabilidad ''{0}'': {1}.
msg.failed.update.responsibility=No se ha podido actualizar la responsabilidad ''{0}'': {1}.
msg.invalid.securing.attribute=Atributo de seguridad no v\u00e1lido ''{0}''.
msg.unsupported.attribute=Nombre de atributo no admitido ''{0}''.
msg.invalid.account.included=La cuenta no v\u00e1lida inclu\u00eda la cl\u00e1usula ''{0}''.
