# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
/*
 * Copyright 2008 Sun Microsystems, Inc. Tous droits r\u00e9serv\u00e9s.
 * 
 * Droits du Gouvernement des \u00c9tats-Unis - Logiciel commercial. Les utilisateurs du gouvernement 
 * sont soumis au contrat de licence standard de Sun Microsystems, Inc.
 * ainsi qu\u2019aux dispositions applicables du FAR et de ses suppl\u00e9ments.
 * 
 * Utilisation soumise au contrat de licence.
 * 
 * Cette distribution peut comprendre des composants d\u00e9velopp\u00e9s par des tiers.
 * Sun, Sun Microsystems, le logo Sun, Java et Project Identity 
 * Connectors sont des marques de fabrique ou des marques d\u00e9pos\u00e9es de Sun 
 * Microsystems, Inc. ou de ses filiales aux \u00c9tats-Unis et dans d\u2019autres
 * pays.
 * 
 * UNIX est une marque d\u00e9pos\u00e9e aux \u00c9tats-Unis et dans d\u2019autres pays,
 * exclusivement utilis\u00e9e sous licence de X/Open Company, Ltd. 
 * 
 * -----------
 * NE MODIFIEZ PAS ET NE SUPPRIMEZ PAS LES MENTIONS DE COPYRIGHT OU CET EN-T\u00caTE.
 * 
 * Copyright 2008 Sun Microsystems, Inc. Tous droits r\u00e9serv\u00e9s. 
 * 
 * Le contenu de ce fichier est soumis aux conditions de la licence CDDL
 * (Common Development and Distribution License), dite la Licence. Vous n\u2019\u00eates pas autoris\u00e9 \u00e0 utiliser ce fichier
 * si vous ne respectez pas les conditions de la Licence. 
 * 
 * Vous pouvez obtenir une copie de la Licence \u00e0 l\u2019adresse
 * http://identityconnectors.dev.java.net/CDDLv1.0.html.
 * Consultez la Licence pour en savoir plus sur les permissions et 
 * les limitations linguistiques sp\u00e9cifiques sous-jacentes.  
 * 
 * Lors de la distribution du Code couvert, ins\u00e9rez cette mention d\u2019en-t\u00eate CDDL
 * dans chaque fichier ainsi que la Licence situ\u00e9e dans le fichier identityconnectors/legal/license.txt.
 * Le cas \u00e9ch\u00e9ant, ins\u00e9rez le texte suivant sous cet en-t\u00eate CDDL, les champs 
 * plac\u00e9s entre crochets [ ] \u00e9tant \u00e0 remplacer par vos propres informations d\u2019identification : 
 * "Parties prot\u00e9g\u00e9es par copyright [ann\u00e9e] [nom du d\u00e9tenteur du copyright]"
 * -----------
 */
 
db2.connector=Connecteur DB2
 
db2.adminAccount.display=Compte d\u2019administration
db2.adminAccount.help=Sp\u00e9cifiez un compte d\u2019administration permettant de se connecter \u00e0 la ressource DB2.
 
db2.adminPassword.display=Mot de passe d\u2019administration
db2.adminPassword.help=Sp\u00e9cifiez le mot de passe du compte d\u2019administration permettant de se connecter \u00e0 la ressource DB2.

db2.jdbcSubProtocol.display=Sous-protocole JDBC
db2.jdbcSubProtocol.help=Sp\u00e9cifiez le sous-protocole JDBC \u00e0 utiliser lors des connexions \u00e0 l\u2019aide d\u2019un pilote de type 4 ou de type 2. Le param\u00e8tre par d\u00e9faut est db2.

db2.databaseName.display=Base de donn\u00e9es
db2.databaseName.help=Sp\u00e9cifiez le nom d\u2019une base de donn\u00e9es locale ou distante \u00e0 utiliser avec un pilote de type 4. Avec un pilote de type 2, saisissez le nom d\u2019un alias catalogu\u00e9.

db2.jdbcDriver.display=Classe du pilote
db2.jdbcDriver.help=Sp\u00e9cifiez le nom d\u2019une classe de pilote de base de donn\u00e9es. Par exemple, pour un pilote JCC de type 4 ou type 2, utilisez com.ibm.db2.jcc.DB2Driver. Pour un pilote CLI de type 2 h\u00e9rit\u00e9, utilisez COM.ibm.db2.jdbc.app.DB2Driver.

db2.host.display=Nom de l\u2019h\u00f4te 
db2.host.help=Sp\u00e9cifiez le nom de l\u2019h\u00f4te ou l\u2019adresse IP du serveur DB2 \u00e0 utiliser avec un pilote de type 4.

db2.port.display=Port
db2.port.help=Sp\u00e9cifiez le port d\u2019\u00e9coute du serveur DB2 \u00e0 utiliser avec un pilote de type 4.

db2.dataSource.display=Source de donn\u00e9es JNDI
db2.dataSource.help=Sp\u00e9cifiez le nom d\u2019une entr\u00e9e de source de donn\u00e9es JNDI. Aucun processus d\u2019ajout de pr\u00e9fixe/suffixe n\u2019est r\u00e9alis\u00e9 dans IDM. Vous devez indiquer un nom JNDI complet.
					
db2.dsJNDIEnv.display=Env. JNDI de source de donn\u00e9es
db2.dsJNDIEnv.help=Sp\u00e9cifiez les entr\u00e9es d\u2019environnement JNDI \u00e0 utiliser avec une source de donn\u00e9es. Indiquez les entr\u00e9es sous forme de paires cl\u00e9/valeur de ce type : cl\u00e91=valeur1, chaque paire figurant sur une ligne distincte. Ces propri\u00e9t\u00e9s sont utilis\u00e9es lors de la cr\u00e9ation d\u2019un contexte initial pour la recherche d\u2019une source de donn\u00e9es. La valeur par d\u00e9faut est vide ; dans ce cas, le contexte local du serveur d\u2019application est utilis\u00e9.

db2.replaceAllGrantsOnUpdate.display=Remplacer les allocations lors des mises \u00e0 jour
db2.replaceAllGrantsOnUpdate.help=Sp\u00e9cifiez si le connecteur DB2 doit remplacer toutes les allocations lors des op\u00e9rations de mise \u00e0 jour. Cette option est fournie \u00e0 des fins de compatibilit\u00e9 ascendante jusqu\u2019\u00e0 ce qu\u2019Identity Manager prenne en charge les op\u00e9rations UpdateAttributeValuesOp. Elle sera peut-\u00eatre supprim\u00e9e dans les prochaines versions d\u2019Identity Manager.
db2.url.display=URL
db2.url.help=Sp\u00e9cifiez l\u2019URL complet de JDBC permettant d\u2019\u00e9tablir la connexion avec DB2. Par ex. : jdbc:db2://localhost:50000/sample.
								  
db2.jdbcDriverClassNotFound=Impossible de charger la classe de pilote JDBC : {0}
db2.validate.fail=La validation de DB2Configuration a \u00e9chou\u00e9. D\u00e9tails : {0}
db2.username.long=Le nom de l\u2019utilisateur comprend plus de {0} caract\u00e8res.
db2.username.contains.illegal.characters=Le nom de l\u2019utilisateur comprend des caract\u00e8res incorrects.
db2.username.is.reserved.word=Le nom de l\u2019utilisateur est un mot-cl\u00e9 r\u00e9serv\u00e9 ou sa sous-cha\u00eene.
db2.username.has.invalid.prefix=Le nom de l\u2019utilisateur comporte un pr\u00e9fixe incorrect.
db2.unsupported.object.class=La classe d\u2019objet [{0}] n\u2019est pas prise en charge. Le connecteur DB2 prend uniquement en charge la classe Account.
db2.authenticate.invalid.credentials=Utilisateur/mot de passe incorrect
db2.name.is.null.or.empty=L\u2019attribut Nom ne peut pas \u00eatre null ou vide.
db2.create.of.user.failed=La cr\u00e9ation de l\u2019utilisateur [{0}] a \u00e9chou\u00e9.
db2.user.already.exists=L\u2019utilisateur [{0}] existe d\u00e9j\u00e0.
db2.user.not.exists=L\u2019utilisateur [{0}] n\u2019existe pas.
db2.delete.of.user.failed=La suppression de l\u2019utilisateur [{0}] a \u00e9chou\u00e9.
db2.name.is.not.updatable=L\u2019attribut du nom ne peut pas \u00eatre mis \u00e0 jour.
db2.update.of.user.failed=La mise \u00e0 jour de l\u2019utilisateur [{0}] a \u00e9chou\u00e9.
db2.update.uid.cannot.be.null.or.empty=L\u2019attribut UID ne peut pas \u00eatre null ou vide lors de la mise \u00e0 jour.
db2.search.failed=La recherche a \u00e9chou\u00e9.
								  
