oracle.connector.display=Conector de Oracle
oracle.host.display=Nombre de host
oracle.host.help=Especifique el nombre de host o la direcci\u00f3n IP del servidor de Oracle
oracle.port.display=Puerto
oracle.port.help=Especifique el puerto de conexi\u00f3n del servidor de Oracle
oracle.driver.display=Clase del controlador
oracle.driver.help=Especifique el nombre de una clase de controlador de Oracle
oracle.database.display=Base de datos
oracle.database.help=Especifique el nombre de una base de datos local o remota 
oracle.user.display=Cuenta de administraci\u00f3n
oracle.user.help=Especifique una cuenta de administraci\u00f3n para conectar con el recurso de Oracle
oracle.password.display=Contrase\u00f1a de administraci\u00f3n
oracle.password.help=Especifique la contrase\u00f1a de la cuenta de administraci\u00f3n para conectar con el recurso de Oracle
oracle.datasource.display=Origen de datos de JNDI
oracle.datasource.help=Especifique la ruta de acceso completa de la entrada de origen de datos de JNDI.
oracle.dsjndienv.display=Entorno JNDI de origen de datos
oracle.dsjndienv.help=Especifique las entradas de entorno de JNDI cuando se utiliza un origen de datos.  Especifique las entradas mediante pares clave/valor con el formato "clave1=valor1", usando una fila nueva para cada par clave/valor.  Estas propiedades se utilizan al crear un contexto inicial para consultar un origen de datos.  El valor predeterminado est\u00e1 vac\u00edo. Cuando est\u00e1 vac\u00edo, se utiliza el contexto local del servidor de aplicaciones.
oracle.url.display=URL
oracle.url.help=Especifique la URL completa de JDBC para conectarse a Oracle. Por ejemplo: oracle:thin:@myhost:1521:XE
oracle.cs.display=Configuraci\u00f3n de diferenciaci\u00f3n de may\u00fasculas y min\u00fasculas
oracle.cs.help=Especifique la configuraci\u00f3n para asignar formato a los tokens de usuario. Defina el valor predeterminado para asignar may\u00fasculas a todos los tokens, excepto globalname. La cadena de entrada se debe especificar con este formato: los normalizadores determinan si los tokens van en may\u00fasculas y los formateadores los encierran entre comillas. Se reconocen los siguientes tokens: USER_NAME, PASSWORD, SCHEMA, ROLE, PRIVILEGE, PROFILE, DEF_TABLESPACE, TEMP_TABLESPACE, GLOBAL_NAME.
oracle.extra.attrs.policy.display=Directiva de atributos adicionales
oracle.extra.attrs.policy.help=Especifique una directiva para aplicarla cuando haya atributos adicionales en una operaci\u00f3n concreta
								  
oracle.source.type.display=Tipo de origen
oracle.source.type.help=Especifique un valor de tipo de origen expl\u00edcito. Cuando se especifica, no interferimos en c\u00f3mo el conector se va a conectar a la base de datos de Oracle. Los valores posibles son: [DataSource, Thin Driver, OCI Driver, Custom Driver]			     
oracle.invalid.auth=Opci\u00f3n de autenticaci\u00f3n no v\u00e1lida [{0}]
oracle.invalid.bracket=Corchetes incorrectos en la cadena [{0}] 
oracle.illegal.right.bracket=Corchete derecho no v\u00e1lido en el \u00edndice [{0}] para [{1}]
oracle.no.eq.char.in.entry=Ning\u00fan car\u00e1cter '=' en la entrada [{0}]
oracle.char.eq.is.at.start.of.entry=El car\u00e1cter '=' se encuentra al principio de la entrada [{0}]
oracle.elements.for.normalizer.not.recognized=Hay elementos no reconocidos en la configuraci\u00f3n de normalizadores: {0}
oracle.elements.for.csbuilder.not.recognized=Hay elementos no reconocidos en la asignaci\u00f3n de configuraci\u00f3n de diferenciaci\u00f3n de may\u00fasculas y min\u00fasculas: {0}
oracle.error.test.user.existence=No se puede comprobar la existencia del usuario
oracle.user.record.not.found=Registro de usuario no encontrado para usuario {0}
oracle.update.of.user.failed=No se pudo actualizar el usuario [{0}]
oracle.addAttributeValues.for.user.failed=No se pudieron agregar valores de atributo para el usuario [{0}]
oracle.removeAttributeValues.for.user.failed=No se pudieron suprimir valores de atributo para el usuario [{0}]
oracle.update.attribute.not.supported=No se admite el atributo [{0}] para actualizar
oracle.addAttributeValues.attribute.not.supported=No se admite el atributo [{0}] para la operaci\u00f3n addAttributeValues
oracle.removeAttributeValues.attribute.not.supported=No se admite el atributo [{0}] para la operaci\u00f3n removeAttributeValues
oracle.update.no.attributes=No hay ning\u00fan atributo para actualizar. Especifique al menos un atributo
oracle.error.executing.search=Ha fallado la ejecuci\u00f3n de la consulta de b\u00fasqueda
oracle.search.attribute.not.supported.for.attributesToGet=No se admite el atributo [{0}] para attributesToGet en la b\u00fasqueda
oracle.search.attribute.not.supported.for.searchBy=No se puede buscar por el atributo [{0}] 
oracle.delete.of.user.failed=No se pudo eliminar el usuario [{0}]
oracle.must.specify.password.for.unexpire=Se debe especificar un atributo de contrase\u00f1a para que la contrase\u00f1a no caduque
oracle.create.no.attributes=No hay ning\u00fan atributo para crear
oracle.create.attribute.not.supported=No se admite el atributo [{0}] para crear
oracle.create.of.user.failed=No se pudo crear el usuario [{0}]
oracle.missing.default.tablespace.for.quota=Falta el espacio de tablas predeterminado, no se puede configurar la cuota
oracle.missing.temporary.tablespace.for.quota=Falta el espacio de tablas temporal, no se puede configurar la cuota
oracle.cannot.set.globalname.for.not.global.authentication=No se puede configurar un nombre global para una autenticaci\u00f3n no global
oracle.cannot.set.password.for.not.local.authentication=No se puede configurar la contrase\u00f1a para una autenticaci\u00f3n no local
oracle.cannot.expire.password.for.not.local.authentication=No se puede caducar la contrase\u00f1a para una autenticaci\u00f3n no local
oracle.missing.globalname.for.global.authentication=Nombre global no especificado para autenticaci\u00f3n global
oracle.boolean.attribute.has.invalid.value=El atributo booleano [{0}] tiene un valor [{1}] no v\u00e1lido 
oracle.attribute.is.empty=El atributo [{0}] est\u00e1 vac\u00edo
oracle.attribute.is.missing=Falta el atributo [{0}] 
oracle.set.driver.or.url=Debe especificarse un controlador delgado, oci o personalizado con la URL completa de JDBC
oracle.cannot.load.driver=No se puede cargar la clase del controlador local: [{0}]
oracle.user.and.password.must.be.set.both.or.none=Defina usuario y contrase\u00f1a (ambos o ninguno)
oracle.thin.connection.error=No se puede crear la conexi\u00f3n utilizando un controlador delgado. Causa: {0}
oracle.oci.connection.error=No se puede crear la conexi\u00f3n utilizando un controlador oci. Causa: {0}
oracle.custom.connection.error=No se puede crear la conexi\u00f3n utilizando una URL o un controlador personalizado. Causa: {0}
oracle.datasource.connection.error=No se puede crear la conexi\u00f3n a partir del origen de datos. Causa: {0}
oracle.enable.lock.attr.value.conflict.false=Los atributos Enable y Lock_out no pueden tener simult\u00e1neamente el valor "false". No es posible inhabilitar y desbloquear el usuario al mismo tiempo.
oracle.enable.lock.attr.value.conflict.true=Los atributos Enable y Lock_out no pueden tener simult\u00e1neamente el valor "true". No es posible habilitar y bloquear el usuario al mismo tiempo.
oracle.invalid.source.type=Tipo de origen no v\u00e1lido. Debe especificarse [DataSource,Custom Driver,Thin Driver,OCI Driver] 
oracle.cs.must.specify.one.array.element=Se debe especificar s\u00f3lo un atributo por elemento de matriz para analizar la diferenciaci\u00f3n de may\u00fasculas y min\u00fasculas
oracle.eap.must.specify.one.array.element=Se debe especificar s\u00f3lo un atributo por elemento de matriz para analizar la directiva de atributos adicionales
oracle.eap.invalid.elements.in.map=Elementos no v\u00e1lidos en asignaci\u00f3n de directiva de atributos adicionales: [{0}]
oracle.eap.cannot.resolve.spi.operation=No se puede resolver SPIOperation con la cadena: [{0}]
