Repository: Evolveum/openicf
Catalog: projects/dotnet/ActiveDirectoryConnector/Messages.*.resx
Languages: de_de, it_it

# connector_displayName
source: Windows Active Directory Connector
it_it: Connettore Windows Active Directory

# display_CreateHomeDirectory
source: Create Home Directory
de_de: Ausgangsverzeichnis erstellen
it_it: Crea directory home

# display_DirectoryAdminName
source: Directory Adminstrator's Account
de_de: Konto des Verzeichnisadministrators
it_it: Account amministratore directory

# display_DirectoryAdminPassword
source: Directory Administrator's Password
de_de: Passwort des Verzeichnisadministrators
it_it: Password amministratore directory

# display_domainName
source: Domain Name
de_de: Domänenname
it_it: Nome dominio

# display_LDAPHostName
source: Active Directory Domain Controller Hostname
de_de: Active Directory Domänencontroller-Hostname
it_it: Nome host controller di dominio Active Directory

# display_ObjectClass
source: Object class for User Objects
de_de: Objektklasse für Benutzerobjekte
it_it: Classe oggetto per oggetti utente

# display_SearchChildDomains
source: Search Child Domains
de_de: Untergeordnete Domänen durchsuchen
it_it: Ricerca nei domini figli

# display_SyncDomainController
source: ActiveSync Domain Controller
de_de: Domänencontroller synchronisieren
it_it: Sincronizza controller di dominio

# display_SyncGlobalCatalogServer
source: ActiveSync Global Catalog Server
de_de: Globalen Katalogserver synchronisieren
it_it: Sincronizza server di catalogo globale

# help_CreateHomeDirectory
source: Specify whether or not the home directory for the user will be created.
de_de: Geben Sie an, ob das Ausgangsverzeichnis des Benutzers erstellt werden soll oder nicht.
it_it: Specificare se verrà creata la directory home dell’utente.

# help_DirectoryAdminName
source: Enter the administrator user name with which the system should authenticate. The setting should be in the form 'domainname'\'username'.
de_de: Geben Sie den Benutzernamen des Administrators ein, mit dem das System authentifiziert werden soll. Die Einstellung kann entweder ein Benutzername oder 'domänenname'\'benutzername' sein.
it_it: Immettere il nome utente dell’amministratore con cui il sistema deve eseguire l’autenticazione. È possibile inserire direttamente il nome utente o usare il formato ’nome_dominio\’nome_utente’.

# help_DirectoryAdminPassword
source: Enter the password that should be used when authenticating.
de_de: Geben Sie das Passwort ein, dass bei der Authentifizierung verwendet werden soll.
it_it: Immettere la password da utilizzare per l’autenticazione.

# help_domainName
source: Name of the windows domain (e.g. windowsdomain.mycompany.com)
de_de: Der Name der Windows-Domäne (z. B. windowsdomaene.eigenefirma.com)
it_it: Nome del dominio Windows (ad es. nomedominio.azienda.com)

# help_LDAPHostName
source: For cross-domain administration, enter the hostname, IP address, or domain name of the LDAP server.
de_de: Für die domänenübergreifende Administration geben Sie den Hostnamen, die IP-Adresse oder den Domänennamen des LDAP-Servers ein.
it_it: Per l’amministrazione interdominio, immettere nome host, indirizzo IP o nome dominio del server LDAP.

# help_ObjectClass
source: Specify the class of object that will be managed on this resource.
de_de: Geben Sie die Aktive Directory-Objektklasse für die Benutzerobjekte an, die auf dieser Ressource verwaltet werden. Die Standardeinstellung lautet User. Für die meisten Anwendungen ist diese Einstellung ausreichend.
it_it: Specificare la classe oggetto di Active Directory per gli oggetti utente che verranno gestiti su questa risorsa. L’impostazione predefinita, User, dovrebbe essere appropriata per la maggior parte delle situazioni.

# help_SearchChildDomains
source: Select if you want searches of Active Directory to include child domains. In addition, the Search Container and Sync Search Context attributes must be set to the top of the parent domain, e.g. DC=mydomain,DC=com.
de_de: Wählen Sie, ob bei Suchabfragen am Active Directory auch untergeordnete Domänen eingeschlossen werden sollen. Außerdem müssen die Attribute "Suchcontainer" und "Suchkontext synchronisieren" (siehe Synchronisationseinstellungen) auf die oberste übergeordnete Domäne festgelegt werden, z. B. DC=mydomain,DC=com.
it_it: Selezionare questa opzione se le ricerche in Active Directory devono includere i domini figli. Inoltre, gli attributi Contenitore di ricerca e Sincronizza contesto di ricerca (vedere le impostazioni di sincronizzazione) devono essere impostati sul livello più elevato del dominio padre, es. DC=nomedominio,DC=com.

# help_SyncDomainController
source: Domain controller to use during active sync. Only used if not searching child domains.
de_de: Bei einer aktiven Synchronisation zu verwendender Domänencontroller. Wird nur dann verwendet, wenn keine untergeordneten Domänen durchsucht werden.
it_it: Il controller di dominio da usare durante Active Sync. Usato solo se non viene eseguita la ricerca nei domini figli.

# help_SyncGlobalCatalogServer
source: Name of the global catalog server. This is needed only if searching child domains
de_de: Name des globalen Katalogservers. Dieser Name ist nur dann erforderlich, wenn untergeordnete Domänen durchsucht werden.
it_it: Nome del server di catalogo globale. È richiesto solo se si esegue la ricerca nei domini figli.

# ex_ConnectorNotConfigured
source: Connector has not been configured
de_de: Der Connector wurde nicht konfiguriert
it_it: Il connettore non è stato configurato

# ex_DeleteNotSupported
source: Delete is not supported for ObjectClass {0}
de_de: Für die Objektklasse {0} wird kein Löschvorgang unterstützt.
it_it: Eliminazione non supportata per la classe oggetto {0}

# ex_InvalidObjectClass
source: Invalid object class: {0}
de_de: Ungültige Objektklasse: {0}
it_it: Classe oggetto non valida: {0}

# ex_missingSyncAttribute
source: Attribute {0} is not present in connector object. Cannot proceed with synchronization
de_de: Das Attribut {0} ist nicht im Connector-Objekt vorhanden. Synchronisierung kann nicht fortgesetzt werden
it_it: L’attributo {0} non è presente nell’oggetto connettore. Impossibile procedere con la sincronizzazione

# ex_OperationalAttributeNull
source: The name operational attribute cannot be null
de_de: Der Name des funktionsbereiten Attributs kann nicht Null lauten
it_it: L’attributo operativo del nome non può essere nullo

# ex_SyncNotAvailable
source: Sync operation is not available for ObjectClass {0}
de_de: Für die Objektklasse {0} ist kein Synchronisierungsvorgang vorhanden.
it_it: L’operazione di sincronizzazione non è disponibile per la classe oggetto {0}

# ex_UIDNotPresent
source: Uid was not present
de_de: Keine UID vorhanden
it_it: UID non presente

# ex_InvalidObjectClassInConfiguration
source: Invalid Object Class was specified in the connector configuration. Object Class \'{0}\' was not found in Active Directory
de_de: In der Connector-Konfiguration wurde eine ungültige Objektklasse angegeben. Die Objektklasse \'{0}\' konnte im Active Directory nicht gefunden werden
it_it: È stata specificata una classe oggetto non valida nella configurazione del connettore. Impossibile trovare la classe oggetto \’{0}\’ in Active Directory

# ex_AttributeNull
source: Could not add connector attribute to <null> search result
de_de: Zu dem Suchergebnis <Null> konnte kein Connector-Attribut hinzugefügt werden
it_it: Impossibile aggiungere l’attributo del connettore a risultati di ricerca nulli

# ex_CouldNotAddNullAttributeToDe
source: Could not add connector attribute to <null> directory entry
de_de: Zu dem Verzeichniseintrag <Null> konnte kein Connector-Attribut hinzugefügt werden
it_it: Impossibile aggiungere l’attributo del connettore a una voce di directory nulla

# ex_ExpectingSingleValue
source: Expecting single value, but found multiple values for attribute {0}
de_de: Einzelner Wert wurde erwartet, es wurden aber mehrere Werte für das Attribut {0} gefunden
it_it: Era atteso un valore singolo ma sono stati trovati più valori per l’attributo {0}

# ex_ObjectClassInvalidForConnector
source: ObjectClass \'{0}\' is not valid for this connector
de_de: Die Objektklasse \'{0}\' ist für diesen Connector nicht zulässig
it_it: La classe oggetto \’{0}\’ non è valida per questo connettore

# ex_InvalidCredentials
source: Invalid credentials supplied for user {0}
de_de: Für den Benutzer {0} wurden ungültige Anmeldedaten angegeben
it_it: Le credenziali fornite per l’utente {0} non sono valide

# ex_PasswordMustBeReset
source: Password expiration can only be reset by reseting the password
de_de: Die Passwortablauffrist kann nur durch Zurücksetzen des Passworts zurückgesetzt werden.
it_it: La scadenza della password può essere modificata solo ripristinando la password

# ex_LockAccountNotAllowed
source: Active Directory does not support locking users. User may be unlocked only
de_de: Active Directory unterstützt das Sperren von Benutzern nicht. Der Benutzer kann nur freigegeben werden
it_it: Active Directory non supporta il blocco degli utenti. Gli utenti possono solo essere sbloccati

# ex_invalidSearchScope
source: An invalid searchscope was supplied: {0}
de_de: Es wurde ein ungültiger Suchbereich angegeben: {0}
it_it: È stato fornito un ambito di ricerca non valido: {0}
