# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
/*
 * Copyright 2008 Sun Microsystems, Inc. Alle Rechte vorbehalten.
 * 
 * Rechte der US-Regierung - Kommerzielle Software. Regierungsbenutzer 
 * unterliegen der standardm\u00e4\u00dfigen Lizenzvereinbarung von Sun Microsystems Inc.
 * sowie den anwendbaren Bestimmungen der FAR und ihrer Zus\u00e4tze.
 * 
 * Die Verwendung unterliegt Lizenzbestimmungen.
 * 
 * Diese Distribution kann von Drittanbietern entwickelte Bestandteile enthalten.
 * Sun, Sun Microsystems, das Sun-Logo, Java und Project Identity- 
 * Konnektoren sind Marken oder eingetragene Marken von Sun 
 * Microsystems, Inc. oder dessen Tochterunternehmen in den Vereinigten Staaten von Amerika und in anderen
 * L\u00e4ndern.
 * 
 * UNIX ist ein eingetragenes Warenzeichen in den USA und in anderen L\u00e4ndern
 * und exklusiv durch X/Open Company, Ltd. lizenziert. 
 * 
 * -----------
 * DIE HINWEISE ZUM URHEBERRECHT BZW. DIESE KOPFZEILE D\u00dcRFEN NICHT GE\u00c4NDERT WERDEN.
 * 
 * Copyright 2008 Sun Microsystems, Inc. Alle Rechte vorbehalten. 
 * 
 * Der Inhalt der Datei unterliegt den Bedingungen der Common Development
 * and Distribution License (CDDL) (die Lizenz). Sie d\u00fcrfen diese Datei
 * ausschlie\u00dflich gem\u00e4\u00df den Bedingungen dieser Lizenz verwenden. 
 * 
 * Eine Kopie dieser Lizenz finden Sie unter
 * http://identityconnectors.dev.java.net/CDDLv1.0.html
 * Informationen zu den landesspezifischen Berechtigungen und 
 * Einschr\u00e4nkungen finden Sie in der Lizenz.  
 * 
 * Wenn der enthaltene Code weitergegeben wird, muss dieser CDDL-Hinweis in jeder
 * Datei und in der Lizenzdatei unter identityconnectors/legal/license.txt enthalten sein.
 * Sofern anwendbar, f\u00fcgen Sie Folgendes unter der CDDL-Kopfzeile ein, dabei ersetzen Sie 
 * die Informationen in Klammern [] durch Ihre eigenen Informationen: 
 * "Copyright f\u00fcr einzelne Teile [Jahr] [Name des Urheberrecht-Eigent\u00fcmers]"
 * -----------
 */
 
db2.connector=DB2-Konnektor
 
db2.adminAccount.display=Administratorkonto
db2.adminAccount.help=Geben Sie ein Administratorkonto f\u00fcr die Verbindung zur DB2-Ressource an.
 
db2.adminPassword.display=Administratorpasswort
db2.adminPassword.help=Geben Sie das Passwort f\u00fcr das Administratorkonto f\u00fcr die Verbindung zur DB2-Ressource an.

db2.jdbcSubProtocol.display=JDBC-Subprotokoll
db2.jdbcSubProtocol.help=Geben Sie das JDBC-Subprotokoll an, das beim Herstellen einer Verbindung mit einem Treiber des Typs 4 oder 2 verwendet werden soll. Die Standardeinstellung ist 'db2'.

db2.databaseName.display=Datenbank
db2.databaseName.help=Geben Sie bei Verwenden eines Treibers des Typs 4 den Namen einer lokalen oder remoten Datenbank ein. Wenn Sie einen Treiber des Typs 2 verwenden, geben Sie den Namen eines katalogisierten Alias ein.

db2.jdbcDriver.display=Treiberklasse
db2.jdbcDriver.help=Geben Sie einen Datenbanktreiber-Klassennamen ein.  Beispielsweise verwenden Sie bei einem JCC-Treiber des Typs 4 oder 2 den Namen 'com.ibm.db2.jcc.DB2Driver'.  F\u00fcr den Legattreiber CLI des Typs 2 verwenden Sie 'COM.ibm.db2.jdbc.app.DB2Driver'.

db2.host.display=Hostname 
db2.host.help=Wenn Sie einen Treiber des Typs 4 verwenden, geben Sie den Hostnamen oder die IP-Adresse des DB2-Servers ein.

db2.port.display=Port
db2.port.help=Wenn Sie einen Treiber des Typs 4 verwenden, geben Sie den \u00fcberwachten Port des DB2-Servers ein.

db2.dataSource.display=JNDI-Datenquelle
db2.dataSource.help=Geben Sie den Namen eines JNDI-Datenquelleneintrags ein. Es wurde kein Pr\u00e4fix-/Postfix-Prozess in IDM ausgef\u00fchrt; geben Sie einen vollst\u00e4ndigen JNDI-Namen ein.
					
db2.dsJNDIEnv.display=Datenquellen-JNDI-Umgebung
db2.dsJNDIEnv.help=Beim Verwenden einer Datenquelle geben Sie die JNDI-Umgebungseintr\u00e4ge ein. Geben Sie Eintr\u00e4ge als Schl\u00fcssel/Wert-Paare in der Form \u201eSchl\u00fcssel1=Wert1\u201c ein, und verwenden Sie f\u00fcr jedes Schl\u00fcssel/Wert-Paar eine neue Zeile. Diese Eigenschaften werden beim Erstellen eines Erstkontextes zur Suche nach einer Datenquelle verwendet. Der Standardwert ist leer; in diesem Fall wird der lokale Kontext des Anwendungsservers verwendet.

db2.replaceAllGrantsOnUpdate.display=Zuteilungen beim Aktualisieren ersetzen
db2.replaceAllGrantsOnUpdate.help=Geben Sie an, ob der DB2-Konnektor alle Zuteilungen bei einer Aktualisierung ersetzt. Dieser Schalter sorgt f\u00fcr die Abw\u00e4rtskompatibilit\u00e4t, bis Identity Manager eine Unterst\u00fctzung f\u00fcr UpdateAttributeValuesOp-Vorg\u00e4nge bereitstellt. Er wird in zuk\u00fcnftigen Versionen von Identity Manager eventuell entfernt.
db2.url.display=URL
db2.url.help=Geben Sie die vollst\u00e4ndige JDBC-URL f\u00fcr die Verbindung mit DB2 an. Beispiel: jdbc:db2://localhost:50000/sample
								  
db2.jdbcDriverClassNotFound=JDBC-Treiberklasse kann nicht geladen werden: {0}
db2.validate.fail=Validierung der DB2-Konfiguration fehlgeschlagen. Details: {0}
db2.username.long=Der Benutzername ist l\u00e4nger als {0} Zeichen
db2.username.contains.illegal.characters=Der Benutzername enth\u00e4lt ung\u00fcltige Zeichen
db2.username.is.reserved.word=Der Benutzername ist ein vorbehaltenes Schl\u00fcsselwort oder dessen Substring
db2.username.has.invalid.prefix=Der Benutzername enth\u00e4lt ein ung\u00fcltiges Pr\u00e4fix
db2.unsupported.object.class=Die Objektklasse [{0}] wird nicht unterst\u00fctzt. Der DB2-Konnektor unterst\u00fctzt nur die Account-Klasse
db2.authenticate.invalid.credentials=Benutzer/Passwort ung\u00fcltig
db2.name.is.null.or.empty=Das Name-Attribut darf nicht Null lauten oder leer sein
db2.create.of.user.failed=Das Erstellen des Benutzers [{0}] ist fehlgeschlagen
db2.user.already.exists=Der Benutzer [{0}] ist bereits vorhanden
db2.user.not.exists=Der Benutzer [{0}] ist nicht vorhanden
db2.delete.of.user.failed=Das L\u00f6schen des Benutzers [{0}] ist fehlgeschlagen
db2.name.is.not.updatable=Das Name-Attribut kann nicht aktualisiert werden
db2.update.of.user.failed=Die Aktualisierung des Benutzers [{0}] ist fehlgeschlagen
db2.update.uid.cannot.be.null.or.empty=Das UID-Attribut darf bei der Aktualisierung nicht Null oder leer sein
db2.search.failed=Suche fehlgeschlagen
								  
