# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2007-2008 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
/*
 * Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 * 
 * U.S. Government Rights - Commercial software. Government users 
 * are subject to the Sun Microsystems, Inc. standard license agreement
 * and applicable provisions of the FAR and its supplements.
 * 
 * Use is subject to license terms.
 * 
 * This distribution may include materials developed by third parties.
 * Sun, Sun Microsystems, the Sun logo, Java and Project Identity 
 * Connectors are trademarks or registered trademarks of Sun 
 * Microsystems, Inc. or its subsidiaries in the U.S. and other
 * countries.
 * 
 * UNIX is a registered trademark in the U.S. and other countries,
 * exclusively licensed through X/Open Company, Ltd. 
 * 
 * -----------
 * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
 * 
 * Copyright 2008 Sun Microsystems, Inc. All rights reserved. 
 * 
 * The contents of this file are subject to the terms of the Common Development
 * and Distribution License(CDDL) (the License). You may not use this file
 * except in compliance with the License. 
 * 
 * You can obtain a copy of the License at
 * http://identityconnectors.dev.java.net/CDDLv1.0.html
 * See the License for the specific language governing permissions and 
 * limitations under the License.  
 * 
 * When distributing the Covered Code, include this CDDL Header Notice in each
 * file and include the License file at identityconnectors/legal/license.txt.
 * If applicable, add the following below this CDDL Header, with the fields 
 * enclosed by brackets [] replaced by your own identifying information: 
 * "Portions Copyrighted [year] [name of copyright owner]"
 * -----------
 */
 
 db2.connector=DB2 \ucee4\ub125\ud130
 
db2.adminAccount.display=\uad00\ub9ac \uacc4\uc815
db2.adminAccount.help=DB2 \uc790\uc6d0\uc5d0 \uc5f0\uacb0\ud558\uae30 \uc704\ud55c \uad00\ub9ac \uacc4\uc815\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4.
 
db2.adminPassword.display=\uad00\ub9ac \ube44\ubc00\ubc88\ud638
db2.adminPassword.help=DB2 \uc790\uc6d0\uc5d0 \uc5f0\uacb0\ud558\uae30 \uc704\ud55c \uad00\ub9ac \uacc4\uc815 \ube44\ubc00\ubc88\ud638\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4.

db2.jdbcSubProtocol.display=JDBC \ud558\uc704 \ud504\ub85c\ud1a0\ucf5c
db2.jdbcSubProtocol.help=\uc720\ud615 4 \ub610\ub294 \uc720\ud615 2 \ub4dc\ub77c\uc774\ubc84\ub97c \uc0ac\uc6a9\ud558\uc5ec \uc5f0\uacb0\ud560 \ub54c \uc0ac\uc6a9\ud560 JDBC \ud558\uc704 \ud504\ub85c\ud1a0\ucf5c\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. \uae30\ubcf8\uac12\uc740 'db2'\uc785\ub2c8\ub2e4.

db2.databaseName.display=\ub370\uc774\ud130\ubca0\uc774\uc2a4
db2.databaseName.help=\uc720\ud615 4 \ub4dc\ub77c\uc774\ubc84\ub97c \uc0ac\uc6a9\ud560 \ub54c \ub85c\uceec \ub610\ub294 \uc6d0\uaca9 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc758 \uc774\ub984\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc720\ud615 2 \ub4dc\ub77c\uc774\ubc84\ub97c \uc0ac\uc6a9\ud560 \ub54c \uce74\ud0c8\ub85c\uadf8\ub85c \ub9cc\ub4e4\uc5b4\uc9c4 \ubcc4\uce6d \uc774\ub984\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.

db2.jdbcDriver.display=\ub4dc\ub77c\uc774\ubc84 \ud074\ub798\uc2a4
db2.jdbcDriver.help=\ub370\uc774\ud130\ubca0\uc774\uc2a4 \ub4dc\ub77c\uc774\ubc84 \ud074\ub798\uc2a4 \uc774\ub984\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc608: JCC \uc720\ud615 4 \ub610\ub294 \uc720\ud615 2 \ub4dc\ub77c\uc774\ubc84\uc758 \uacbd\uc6b0 'com.ibm.db2.jcc.DB2Driver'\ub97c \uc0ac\uc6a9\ud569\ub2c8\ub2e4. \ub808\uac70\uc2dc CLI \uc720\ud615 2 \ub4dc\ub77c\uc774\ubc84\uc758 \uacbd\uc6b0 'COM.ibm.db2.jdbc.app.DB2Driver'\ub97c \uc0ac\uc6a9\ud569\ub2c8\ub2e4.

db2.host.display=\ud638\uc2a4\ud2b8 \uc774\ub984 
db2.host.help=\uc720\ud615 4 \ub4dc\ub77c\uc774\ubc84\ub97c \uc0ac\uc6a9\ud560 \ub54c DB2 \uc11c\ubc84\uc758 \ud638\uc2a4\ud2b8 \uc774\ub984 \ub610\ub294 IP \uc8fc\uc18c\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4.

db2.port.display=\ud3ec\ud2b8
db2.port.help=\uc720\ud615 4 \ub4dc\ub77c\uc774\ubc84\ub97c \uc0ac\uc6a9\ud560 \ub54c DB2 \uc11c\ubc84\uc758 \uc218\uc2e0 \ud3ec\ud2b8\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4.

db2.dataSource.display=JNDI \ub370\uc774\ud130 \uc18c\uc2a4
db2.dataSource.help=JNDI \ub370\uc774\ud130 \uc18c\uc2a4 \ud56d\ubaa9\uc758 \uc774\ub984\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. IDM\uc5d0 \uc218\ud589\ub41c \uc811\ub450\uc5b4/\uc811\ubbf8\uc5b4 \ud504\ub85c\uc138\uc2a4\uac00 \uc5c6\uc2b5\ub2c8\ub2e4. \uc804\uccb4 JNDI \uc774\ub984\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4.
					
db2.dsJNDIEnv.display=\ub370\uc774\ud130 \uc18c\uc2a4 JNDI \ud658\uacbd
db2.dsJNDIEnv.help=\ub370\uc774\ud130 \uc18c\uc2a4\ub97c \uc0ac\uc6a9\ud560 \ub54c JNDI \ud658\uacbd \ud56d\ubaa9\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. \ud56d\ubaa9\uc744 \uac01 \ud0a4/\uac12 \uc30d\uc774 \uc0c8\ub85c\uc6b4 \ud589\uc5d0 \uc788\ub294 "key1=value1" \ud615\uc2dd\uc758 \ud0a4/\uac12 \uc30d\uc73c\ub85c \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc774\ub7ec\ud55c \uc18d\uc131\uc740 \ub370\uc774\ud130 \uc18c\uc2a4 \uc870\ud68c\ub97c \uc704\ud55c \ucd08\uae30 \ucee8\ud14d\uc2a4\ud2b8\ub97c \ub9cc\ub4e4 \ub54c \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \uae30\ubcf8\uac12\uc740 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \uc774 \uacbd\uc6b0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc11c\ubc84 \ub85c\uceec \ucee8\ud14d\uc2a4\ud2b8\uac00 \uc0ac\uc6a9\ub429\ub2c8\ub2e4.

db2.replaceAllGrantsOnUpdate.display=\uc5c5\ub370\uc774\ud2b8 \ud5c8\uac00 \ub300\uccb4
db2.replaceAllGrantsOnUpdate.help=\uc5c5\ub370\uc774\ud2b8 \uc791\uc5c5\uc774 \uc9c4\ud589\ub418\ub294 \ub3d9\uc548 DB2 \ucee4\ub125\ud130\uac00 \ubaa8\ub4e0 \ud5c8\uac00\ub97c \ub300\uccb4\ud560 \uac83\uc778\uc9c0 \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc774 \uc2a4\uc704\uce58\ub294 Identity Manager\uac00 UpdateAttributeValuesOp \uc791\uc5c5\uc744 \uc9c0\uc6d0\ud560 \ub54c\uae4c\uc9c0 \uc5ed\ubc29\ud5a5 \ud638\ud658\uc744 \uc704\ud574 \uc81c\uacf5\ub418\uba70 \ud5a5\ud6c4 Identity Manager \ubc84\uc804\uc5d0\uc11c \uc81c\uac70\ub420 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4.
db2.url.display=URL
db2.url.help=DB2\uc5d0 \uc5f0\uacb0\ud558\uae30 \uc704\ud55c \uc804\uccb4 jdbc url\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc608: jdbc:db2://localhost:50000/sample
								  
db2.jdbcDriverClassNotFound=jdbc \ub4dc\ub77c\uc774\ubc84 \ud074\ub798\uc2a4 {0}\uc744(\ub97c) \ub85c\ub4dc\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
db2.validate.fail=DB2Configuration \uac80\uc99d\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4. \uc138\ubd80 \uc815\ubcf4: {0}
db2.username.long=\uc0ac\uc6a9\uc790 \uc774\ub984\uc774 {0}\uc790\ubcf4\ub2e4 \uae41\ub2c8\ub2e4.
db2.username.contains.illegal.characters=\uc0ac\uc6a9\uc790 \uc774\ub984\uc5d0 \uc798\ubabb\ub41c \ubb38\uc790\uac00 \ud3ec\ud568\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
db2.username.is.reserved.word=\uc0ac\uc6a9\uc790 \uc774\ub984\uc774 \uc608\uc57d\ub41c \ud0a4\uc6cc\ub4dc\uc774\uac70\ub098 \uc774 \ud0a4\uc6cc\ub4dc\uc758 \ud558\uc704 \ubb38\uc790\uc5f4\uc785\ub2c8\ub2e4.
db2.unsupported.object.class=\uac1d\uccb4 \ud074\ub798\uc2a4 [{0}]\uc740(\ub294) \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. DB2 \ucee4\ub125\ud130\ub294 \uacc4\uc815 \ud074\ub798\uc2a4\ub9cc \uc9c0\uc6d0\ud569\ub2c8\ub2e4.
db2.authenticate.invalid.credentials=\uc778\uc99d\ud558\ub294 \ub3d9\uc548 \uc0ac\uc6a9\uc790/\ube44\ubc00\ubc88\ud638\uac00 \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
db2.name.is.null.or.empty=\uc774\ub984 \uc18d\uc131\uc740 null \ub610\ub294 \ube44\uc5b4 \uc788\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
db2.create.of.user.failed=\uc0ac\uc6a9\uc790 [{0}] \ub9cc\ub4e4\uae30\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
db2.user.already.exists=\uc0ac\uc6a9\uc790 [{0}]\uc774(\uac00) \uc774\ubbf8 \uc788\uc2b5\ub2c8\ub2e4.
db2.user.not.exists=\uc0ac\uc6a9\uc790 [{0}]\uc774(\uac00) \uc5c6\uc2b5\ub2c8\ub2e4.
db2.delete.of.user.failed=\uc0ac\uc6a9\uc790 [{0}] \uc0ad\uc81c\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
db2.name.is.not.updatable=\uc774\ub984 \uc18d\uc131\uc740 \uc5c5\ub370\uc774\ud2b8\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
db2.update.of.user.failed=\uc0ac\uc6a9\uc790 [{0}] \uc5c5\ub370\uc774\ud2b8\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
db2.update.uid.cannot.be.null.or.empty=UID \uc18d\uc131\uc740 \uc5c5\ub370\uc774\ud2b8\uc5d0\uc11c null \ub610\ub294 \ube44\uc5b4 \uc788\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
db2.search.failed=\uac80\uc0c9\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
								  