# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2007-2008 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
/*
 * Copyright 2008 Sun Microsystems, Inc. Todos los derechos reservados.
 * 
 * Derechos del gobierno de Estados Unidos: software comercial. Los usuarios gubernamentales 
 * est\u00e1n sujetos a las cl\u00e1usulas del acuerdo de licencia est\u00e1ndar de Sun Microsystems, Inc.
 * y a las disposiciones aplicables de la legislaci\u00f3n FAR y sus suplementos.
 * 
 * El uso est\u00e1 sujeto a las condiciones de la licencia. 
 * 
 * La distribuci\u00f3n puede incluir materiales desarrollados por terceras partes. 
 * Sun, Sun Microsystems, el logotipo de Sun, Java y Project Identity 
 * Connectors son marcas comerciales o marcas comerciales registradas de Sun  
 * Microsystems, Inc. o de sus filiales en EE.UU. y en otros 
 * pa\u00edses.
 * 
 * UNIX es una marca comercial registrada en EE.UU. y en otros pa\u00edses,
 * cuya licencia se otorga exclusivamente a trav\u00e9s de X/Open Company, Ltd. 
 * 
 * -----------
 * NO MODIFICAR O ELIMINAR LAS NOTAS DE COPYRIGHT NI ESTE ENCABEZADO.
 * 
 * Copyright 2008 Sun Microsystems, Inc. Todos los derechos reservados. 
 * 
 * El contenido de este archivo est\u00e1 sujeto a los t\u00e9rminos de la Licencia com\u00fan de desarrollo 
 * y distribuci\u00f3n (CDDL) (la Licencia).  Este archivo s\u00f3lo puede utilizarse 
 * de conformidad con la Licencia. 
 * 
 * Puede obtener una copia de la Licencia en
 * http://identityconnectors.dev.java.net/CDDLv1.0.html
 * Consulte la Licencia para conocer los permisos espec\u00edficos que rigen cada idioma y  
 * las limitaciones que estipula la Licencia.  
 * 
 * Cuando distribuya el C\u00f3digo cubierto, incluya esta Nota de encabezado de CDDL en cada 
 * archivo, e incluya el archivo de la Licencia en identityconnectors/legal/license.txt.
 * Si procede, a\u00f1ada lo siguiente bajo este encabezado de CDDL, sustituyendo los campos  
 * indicados entre corchetes [] por su informaci\u00f3n identificativa: 
 * "Porciones protegidas por Copyright [a\u00f1o] [nombre del propietario del Copyright]"
 * -----------
 */
 
 db2.connector=Conector de DB2
 
db2.adminAccount.display=Cuenta de administraci\u00f3n
db2.adminAccount.help=Especifique una cuenta de administraci\u00f3n para conectar con el recurso de DB2.
 
db2.adminPassword.display=Contrase\u00f1a de administraci\u00f3n
db2.adminPassword.help=Especifique la contrase\u00f1a de la cuenta de administraci\u00f3n para conectar con el recurso de DB2.

db2.jdbcSubProtocol.display=Subprotocolo JDBC
db2.jdbcSubProtocol.help=Especifique el subprotocolo JDBC que se debe usar al conectar mediante un controlador de tipo 4 o tipo 2.  El valor predeterminado es 'db2'.

db2.databaseName.display=Base de datos
db2.databaseName.help=Especifique el nombre de una base de datos local o remota al usar un controlador de tipo 4.  Si se utiliza un controlador de tipo 2, introduzca el nombre de un alias catalogado.

db2.jdbcDriver.display=Clase del controlador
db2.jdbcDriver.help=Especifique el nombre de una clase de controlador de base de datos.  Por ejemplo, si se trata de un controlador JCC de tipo 4 o 2, use 'com.ibm.db2.jcc.DB2Driver'.  En el caso de un controlador CLI anterior de tipo 2, use 'COM.ibm.db2.jdbc.app.DB2Driver'.

db2.host.display=Nombre de host 
db2.host.help=Especifique el nombre de host o la direcci\u00f3n IP del servidor de DB2 cuando se utiliza un controlador de tipo 4.

db2.port.display=Puerto
db2.port.help=Especifique el puerto de conexi\u00f3n del servidor de DB2 cuando se utiliza un controlador de tipo 4.

db2.dataSource.display=Origen de datos de JNDI
db2.dataSource.help=Especifique el nombre de una entrada de origen de datos de JNDI.  No se ha realizado ning\u00fan proceso de prefijo/sufijo en IDM; especifique un nombre JNDI completo.
					
db2.dsJNDIEnv.display=Ent JNDI de origen de datos
db2.dsJNDIEnv.help=Especifique las entradas de entorno de JNDI cuando se utiliza un origen de datos.  Especifique las entradas mediante pares clave/valor con el formato "clave1=valor1", usando una fila nueva para cada par clave/valor.  Estas propiedades se utilizan al crear un contexto inicial para consultar un origen de datos.  El valor predeterminado est\u00e1 vac\u00edo; en tal caso, se utiliza el contexto local del servidor de aplicaciones.

db2.replaceAllGrantsOnUpdate.display=Sustituir concesiones al actualizar
db2.replaceAllGrantsOnUpdate.help=Especifique si el conector de DB2 debe sustituir todas las concesiones durante una operaci\u00f3n de actualizaci\u00f3n.  Esta opci\u00f3n se incluye para proporcionar compatibilidad con versiones anteriores hasta que Identity Manager admita operaciones de actualizaci\u00f3n de valores de atributo (UpdateAttributeValuesOp), por lo que quiz\u00e1 desaparezca en futuras versiones de Identity Manager.
db2.url.display=URL
db2.url.help=Especifique la URL completa de JDBC para conectarse a DB2. Ej. jdbc:db2://localhost:50000/ejemplo
								  
db2.jdbcDriverClassNotFound=No se puede cargar la clase del controlador JDBC local : {0}
db2.validate.fail=Ha fallado la validaci\u00f3n de la configuraci\u00f3n de DB2. Detalles: {0}
db2.username.long=El nombre de usuario tiene m\u00e1s de {0} caracteres
db2.username.contains.illegal.characters=El nombre de usuario contiene caracteres no v\u00e1lidos
db2.username.is.reserved.word=El nombre de usuario es una contrase\u00f1a reservada o su subcadena
db2.unsupported.object.class=No se admite la clase de objeto [{0}]. El conector de DB2 s\u00f3lo admite la clase Cuenta
db2.authenticate.invalid.credentials=Usuario/contrase\u00f1a no v\u00e1lidos al autenticar
db2.name.is.null.or.empty=El nombre de atributo no puede ser nulo ni estar vac\u00edo
db2.create.of.user.failed=No se pudo crear el usuario [{0}]
db2.user.already.exists=El usuario [{0}] ya existe
db2.user.not.exists=El usuario [{0}] no existe
db2.delete.of.user.failed=No se pudo eliminar el usuario [{0}]
db2.name.is.not.updatable=El nombre de atributo no es actualizable
db2.update.of.user.failed=No se pudo actualizar el usuario [{0}]
db2.update.uid.cannot.be.null.or.empty=El atributo UID no puede ser nulo ni estar vac\u00edo al actualizar
db2.search.failed=Ha fallado la b\u00fasqueda
								  