# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2007-2008 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
/*
 * Copyright 2008 Sun Microsystems, Inc. Todos os direitos reservados.
 * 
 * Direitos governamentais dos EUA - Software comercial. Usu\u00e1rios governamentais 
 * nos EUA est\u00e3o sujeitos ao contrato de licen\u00e7a padr\u00e3o da Sun Microsystems, Inc.
 *  e \u00e0s cl\u00e1usulas aplic\u00e1veis da FAR e de seus anexos.
 * 
 * O uso est\u00e1 sujeito aos termos da licen\u00e7a. 
 * 
 * Esta distribui\u00e7\u00e3o pode incluir materiais desenvolvidos por terceiros. 
 * Sun, Sun Microsystems, o logotipo Sun, Java e Project Identity 
 * Connectors s\u00e3o marcas comerciais ou marcas registradas da Sun 
 * Microsystems, Inc. ou de suas subsidi\u00e1rias nos EUA e em outros
 * pa\u00edses.
 * 
 * UNIX \u00e9 uma marca registrada nos EUA e em outros pa\u00edses,
 * exclusivamente licenciada atrav\u00e9s da X/Open Company, Ltd. 
 * 
 * -----------
 * N\u00c3O ALTERE NEM REMOVA AVISOS DE DIREITOS AUTORAIS OU ESTE CABE\u00c7ALHO.
 * 
 * Copyright 2008 Sun Microsystems, Inc. Todos os direitos reservados. 
 * 
 * O conte\u00fado deste arquivo est\u00e1 sujeito aos termos da Common Development
 * and Distribution License (CDDL) (a Licen\u00e7a).  Voc\u00ea n\u00e3o poder\u00e1 usar este arquivo
 * se n\u00e3o estiver em conformidade com a Licen\u00e7a. 
 * 
 * Voc\u00ea pode obter uma c\u00f3pia da Licen\u00e7a em
 * http://identityconnectors.dev.java.net/CDDLv1.0.html
 * Consulte a Licen\u00e7a para obter as limita\u00e7\u00f5es e as permiss\u00f5es aplic\u00e1veis ao 
 * idioma espec\u00edfico de acordo com a Licen\u00e7a.  
 * 
 * Ao distribuir c\u00f3digo coberto, inclua este aviso de cabe\u00e7alho CDDL em cada
 *  arquivo e inclua o arquivo de Licen\u00e7a em identityconnectors/legal/license.txt.
 * Se aplic\u00e1vel, adicione o seguinte texto abaixo do cabe\u00e7alho CDDL, com os campos 
 *  entre colchetes [] substitu\u00eddos por suas pr\u00f3prias informa\u00e7\u00f5es de identifica\u00e7\u00e3o: 
 * "Partes sob Copyright [ano] [nome do propriet\u00e1rio do copyright]"
 * -----------
 */
 
 db2.connector=Conector DB2
 
db2.adminAccount.display=Conta de administra\u00e7\u00e3o
db2.adminAccount.help=Especifique uma conta de administra\u00e7\u00e3o para conex\u00e3o com o recurso DB2.
 
db2.adminPassword.display=Senha de administra\u00e7\u00e3o
db2.adminPassword.help=Especifique a senha da conta de administra\u00e7\u00e3o para conex\u00e3o com o recurso DB2.

db2.jdbcSubProtocol.display=Subprotocolo JDBC
db2.jdbcSubProtocol.help=Especifique o subprotocolo JDBC a ser usado quando a conex\u00e3o for estabelecida por meio de um driver do tipo 2 ou 4.  O padr\u00e3o \u00e9 'db2'.

db2.databaseName.display=Banco de dados
db2.databaseName.help=Especifique o nome de um banco de dados local ou remoto ao usar um driver do tipo 4.  Ao usar um driver do tipo 2, digite o nome de um alias catalogado.

db2.jdbcDriver.display=Classe de driver
db2.jdbcDriver.help=Especifique o nome de classe de driver de banco de dados.  Por exemplo, para um driver JCC do tipo 4 ou 2, use 'com.ibm.db2.jcc.DB2Driver'.  Para um driver CLI legado do tipo 2, use 'COM.ibm.db2.jdbc.app.DB2Driver'.

db2.host.display=Nome do host 
db2.host.help=Especifique o nome do host ou o endere\u00e7o IP do servidor DB2 ao usar um driver do tipo 4.

db2.port.display=Porta
db2.port.help=Especifique a porta ativa do servidor DB2 ao usar um driver do tipo 4.

db2.dataSource.display=Fonte de dados JNDI
db2.dataSource.help=Especifique a nome de uma entrada de fonte de dados JNDI.  N\u00e3o existe nenhum processo de prefixo/sufixo conclu\u00eddo no IDM. Especifique um nome JNDI completo.
					
db2.dsJNDIEnv.display=Ambiente JNDI da fonte de dados
db2.dsJNDIEnv.help=Especifique as entradas de ambiente JNDI ao usar uma fonte de dados.  Especifique entradas como pares de chave/valor no formato "chave1=valor1", com cada par de chave/valor em uma nova linha.  Essas propriedades s\u00e3o usadas ao se criar um contexto inicial para a pesquisa de uma fonte de dados.  O valor padr\u00e3o \u00e9 vazio. Nesse caso, ser\u00e1 usado o contexto local do servidor de aplicativos.

db2.replaceAllGrantsOnUpdate.display=Substituir concess\u00f5es na atualiza\u00e7\u00e3o
db2.replaceAllGrantsOnUpdate.help=Especifique se o conector DB2 substituir\u00e1 todas as concess\u00f5es durante uma opera\u00e7\u00e3o de atualiza\u00e7\u00e3o.  Essa op\u00e7\u00e3o ser\u00e1 fornecida para compatibilidade com vers\u00f5es anteriores at\u00e9 que o Identity Manager ofere\u00e7a suporte para opera\u00e7\u00f5es UpdateAttributeValuesOp e poder\u00e1 ser removida de vers\u00f5es futuras do Identity Manager.
db2.url.display=URL
db2.url.help=Especifique o URL JDBC completo para conex\u00e3o com o DB2. Por exemplo, jdbc:db2://localhost:50000/sample
								  
db2.jdbcDriverClassNotFound=N\u00e3o \u00e9 poss\u00edvel carregar a classe de driver jdbc: {0}
db2.validate.fail=Falha na valida\u00e7\u00e3o de DB2Configuration. Detalhes : {0}
db2.username.long=O nome do usu\u00e1rio tem mais de {0} caracteres
db2.username.contains.illegal.characters=O nome do usu\u00e1rio cont\u00e9m caracteres ilegais
db2.username.is.reserved.word=O nome do usu\u00e1rio \u00e9 uma palavra-chave reservada ou sua subseq\u00fc\u00eancia
db2.unsupported.object.class=N\u00e3o existe suporte para a classe de objeto [{0}]. O conector DB2 s\u00f3 oferece suporte para a classe Conta
db2.authenticate.invalid.credentials=Senha/usu\u00e1rio inv\u00e1lido durante a autentica\u00e7\u00e3o
db2.name.is.null.or.empty=O atributo Nome n\u00e3o pode ser nulo nem ficar vazio
db2.create.of.user.failed=Falha ao criar o usu\u00e1rio [{0}]
db2.user.already.exists=O usu\u00e1rio [{0}] j\u00e1 existe
db2.user.not.exists=O usu\u00e1rio [{0}] n\u00e3o existe
db2.delete.of.user.failed=Falha ao excluir o usu\u00e1rio [{0}]
db2.name.is.not.updatable=O atributo Nome n\u00e3o pode ser atualizado
db2.update.of.user.failed=Falha ao atualizar o usu\u00e1rio [{0}]
db2.update.uid.cannot.be.null.or.empty=O atributo UID n\u00e3o pode ser nulo nem ficar vazio na atualiza\u00e7\u00e3o
db2.search.failed=Falha na pesquisa
								  